Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpl064.h
extern volatile __IPC30bits_t IPC30bits __asm__ ("IPC30") __attribute__((section("sfrs"), address(0xBF810320)));
extern volatile uint32_t        IPC30CLR __attribute__((section("sfrs"),address(0xBF810324)));
extern volatile uint32_t        IPC30SET __attribute__((section("sfrs"),address(0xBF810328)));
extern volatile uint32_t        IPC30INV __attribute__((section("sfrs"),address(0xBF81032C)));
#define IPC31 IPC31
extern volatile uint32_t   IPC31 __attribute__((section("sfrs"), address(0xBF810330)));
typedef union {
  struct {
    uint32_t AD1D18IS:2;
    uint32_t AD1D18IP:3;
    uint32_t :3;
    uint32_t AD1D19IS:2;
    uint32_t AD1D19IP:3;
    uint32_t :3;
    uint32_t AD1D20IS:2;
    uint32_t AD1D20IP:3;
    uint32_t :3;
    uint32_t AD1D21IS:2;
    uint32_t AD1D21IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC31bits_t;
extern volatile __IPC31bits_t IPC31bits __asm__ ("IPC31") __attribute__((section("sfrs"), address(0xBF810330)));
extern volatile uint32_t        IPC31CLR __attribute__((section("sfrs"),address(0xBF810334)));
extern volatile uint32_t        IPC31SET __attribute__((section("sfrs"),address(0xBF810338)));
extern volatile uint32_t        IPC31INV __attribute__((section("sfrs"),address(0xBF81033C)));
#define IPC32 IPC32
extern volatile uint32_t   IPC32 __attribute__((section("sfrs"), address(0xBF810340)));
typedef union {
  struct {
    uint32_t AD1D22IS:2;
    uint32_t AD1D22IP:3;
    uint32_t :3;
    uint32_t AD1D23IS:2;
    uint32_t AD1D23IP:3;
    uint32_t :3;
    uint32_t AD1D24IS:2;
    uint32_t AD1D24IP:3;
    uint32_t :3;
    uint32_t AD1D25IS:2;
    uint32_t AD1D25IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC32bits_t;
extern volatile __IPC32bits_t IPC32bits __asm__ ("IPC32") __attribute__((section("sfrs"), address(0xBF810340)));
extern volatile uint32_t        IPC32CLR __attribute__((section("sfrs"),address(0xBF810344)));
extern volatile uint32_t        IPC32SET __attribute__((section("sfrs"),address(0xBF810348)));
extern volatile uint32_t        IPC32INV __attribute__((section("sfrs"),address(0xBF81034C)));
#define IPC33 IPC33
extern volatile uint32_t   IPC33 __attribute__((section("sfrs"), address(0xBF810350)));
typedef union {
  struct {
    uint32_t AD1D26IS:2;
    uint32_t AD1D26IP:3;
    uint32_t :3;
    uint32_t AD1D27IS:2;
    uint32_t AD1D27IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC33bits_t;
extern volatile __IPC33bits_t IPC33bits __asm__ ("IPC33") __attribute__((section("sfrs"), address(0xBF810350)));
extern volatile uint32_t        IPC33CLR __attribute__((section("sfrs"),address(0xBF810354)));
extern volatile uint32_t        IPC33SET __attribute__((section("sfrs"),address(0xBF810358)));
extern volatile uint32_t        IPC33INV __attribute__((section("sfrs"),address(0xBF81035C)));
#define IPC34 IPC34
extern volatile uint32_t   IPC34 __attribute__((section("sfrs"), address(0xBF810360)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t AD1D33IS:2;
    uint32_t AD1D33IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC34bits_t;
extern volatile __IPC34bits_t IPC34bits __asm__ ("IPC34") __attribute__((section("sfrs"), address(0xBF810360)));
extern volatile uint32_t        IPC34CLR __attribute__((section("sfrs"),address(0xBF810364)));
extern volatile uint32_t        IPC34SET __attribute__((section("sfrs"),address(0xBF810368)));
extern volatile uint32_t        IPC34INV __attribute__((section("sfrs"),address(0xBF81036C)));
#define IPC35 IPC35
extern volatile uint32_t   IPC35 __attribute__((section("sfrs"), address(0xBF810370)));
typedef union {
  struct {
    uint32_t AD1D34IS:2;
    uint32_t AD1D34IP:3;
    uint32_t :3;
    uint32_t AD1D35IS:2;
    uint32_t AD1D35IP:3;
    uint32_t :3;
    uint32_t AD1D36IS:2;
    uint32_t AD1D36IP:3;
    uint32_t :3;
    uint32_t AD1D37IS:2;
    uint32_t AD1D37IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC35bits_t;
extern volatile __IPC35bits_t IPC35bits __asm__ ("IPC35") __attribute__((section("sfrs"), address(0xBF810370)));
extern volatile uint32_t        IPC35CLR __attribute__((section("sfrs"),address(0xBF810374)));
extern volatile uint32_t        IPC35SET __attribute__((section("sfrs"),address(0xBF810378)));
extern volatile uint32_t        IPC35INV __attribute__((section("sfrs"),address(0xBF81037C)));
#define IPC36 IPC36
extern volatile uint32_t   IPC36 __attribute__((section("sfrs"), address(0xBF810380)));
typedef union {
  struct {
    uint32_t AD1D38IS:2;
    uint32_t AD1D38IP:3;
    uint32_t :3;
    uint32_t AD1D39IS:2;
    uint32_t AD1D39IP:3;
    uint32_t :3;
    uint32_t AD1D40IS:2;
    uint32_t AD1D40IP:3;
    uint32_t :3;
    uint32_t AD1D41IS:2;
    uint32_t AD1D41IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC36bits_t;
extern volatile __IPC36bits_t IPC36bits __asm__ ("IPC36") __attribute__((section("sfrs"), address(0xBF810380)));
extern volatile uint32_t        IPC36CLR __attribute__((section("sfrs"),address(0xBF810384)));
extern volatile uint32_t        IPC36SET __attribute__((section("sfrs"),address(0xBF810388)));
extern volatile uint32_t        IPC36INV __attribute__((section("sfrs"),address(0xBF81038C)));
#define IPC37 IPC37
extern volatile uint32_t   IPC37 __attribute__((section("sfrs"), address(0xBF810390)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t AD1D45IS:2;
    uint32_t AD1D45IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC37bits_t;
extern volatile __IPC37bits_t IPC37bits __asm__ ("IPC37") __attribute__((section("sfrs"), address(0xBF810390)));
extern volatile uint32_t        IPC37CLR __attribute__((section("sfrs"),address(0xBF810394)));
extern volatile uint32_t        IPC37SET __attribute__((section("sfrs"),address(0xBF810398)));
extern volatile uint32_t        IPC37INV __attribute__((section("sfrs"),address(0xBF81039C)));
#define IPC38 IPC38
extern volatile uint32_t   IPC38 __attribute__((section("sfrs"), address(0xBF8103A0)));
typedef union {
  struct {
    uint32_t AD1D46IS:2;
    uint32_t AD1D46IP:3;
    uint32_t :3;
    uint32_t AD1D47IS:2;
    uint32_t AD1D47IP:3;
    uint32_t :3;
    uint32_t AD1D48IS:2;
    uint32_t AD1D48IP:3;
    uint32_t :3;
    uint32_t AD1D49IS:2;
    uint32_t AD1D49IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC38bits_t;
