Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpl064.h
extern volatile __CFD1FIFOCON19bits_t CFD1FIFOCON19bits __asm__ ("CFD1FIFOCON19") __attribute__((section("sfrs"), address(0xBF8804D0)));
extern volatile uint32_t        CFD1FIFOCON19CLR __attribute__((section("sfrs"),address(0xBF8804D4)));
extern volatile uint32_t        CFD1FIFOCON19SET __attribute__((section("sfrs"),address(0xBF8804D8)));
extern volatile uint32_t        CFD1FIFOCON19INV __attribute__((section("sfrs"),address(0xBF8804DC)));
#define CFD1FIFOSTA19 CFD1FIFOSTA19
extern volatile uint32_t   CFD1FIFOSTA19 __attribute__((section("sfrs"), address(0xBF8804E0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA19bits_t;
extern volatile __CFD1FIFOSTA19bits_t CFD1FIFOSTA19bits __asm__ ("CFD1FIFOSTA19") __attribute__((section("sfrs"), address(0xBF8804E0)));
extern volatile uint32_t        CFD1FIFOSTA19CLR __attribute__((section("sfrs"),address(0xBF8804E4)));
extern volatile uint32_t        CFD1FIFOSTA19SET __attribute__((section("sfrs"),address(0xBF8804E8)));
extern volatile uint32_t        CFD1FIFOSTA19INV __attribute__((section("sfrs"),address(0xBF8804EC)));
#define CFD1FIFOUA19 CFD1FIFOUA19
extern volatile uint32_t   CFD1FIFOUA19 __attribute__((section("sfrs"), address(0xBF8804F0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA19bits_t;
extern volatile __CFD1FIFOUA19bits_t CFD1FIFOUA19bits __asm__ ("CFD1FIFOUA19") __attribute__((section("sfrs"), address(0xBF8804F0)));
extern volatile uint32_t        CFD1FIFOUA19CLR __attribute__((section("sfrs"),address(0xBF8804F4)));
extern volatile uint32_t        CFD1FIFOUA19SET __attribute__((section("sfrs"),address(0xBF8804F8)));
extern volatile uint32_t        CFD1FIFOUA19INV __attribute__((section("sfrs"),address(0xBF8804FC)));
#define CFD1FIFOCON20 CFD1FIFOCON20
extern volatile uint32_t   CFD1FIFOCON20 __attribute__((section("sfrs"), address(0xBF880500)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON20bits_t;
extern volatile __CFD1FIFOCON20bits_t CFD1FIFOCON20bits __asm__ ("CFD1FIFOCON20") __attribute__((section("sfrs"), address(0xBF880500)));
extern volatile uint32_t        CFD1FIFOCON20CLR __attribute__((section("sfrs"),address(0xBF880504)));
extern volatile uint32_t        CFD1FIFOCON20SET __attribute__((section("sfrs"),address(0xBF880508)));
extern volatile uint32_t        CFD1FIFOCON20INV __attribute__((section("sfrs"),address(0xBF88050C)));
#define CFD1FIFOSTA20 CFD1FIFOSTA20
extern volatile uint32_t   CFD1FIFOSTA20 __attribute__((section("sfrs"), address(0xBF880510)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA20bits_t;
extern volatile __CFD1FIFOSTA20bits_t CFD1FIFOSTA20bits __asm__ ("CFD1FIFOSTA20") __attribute__((section("sfrs"), address(0xBF880510)));
extern volatile uint32_t        CFD1FIFOSTA20CLR __attribute__((section("sfrs"),address(0xBF880514)));
extern volatile uint32_t        CFD1FIFOSTA20SET __attribute__((section("sfrs"),address(0xBF880518)));
extern volatile uint32_t        CFD1FIFOSTA20INV __attribute__((section("sfrs"),address(0xBF88051C)));
#define CFD1FIFOUA20 CFD1FIFOUA20
extern volatile uint32_t   CFD1FIFOUA20 __attribute__((section("sfrs"), address(0xBF880520)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA20bits_t;
extern volatile __CFD1FIFOUA20bits_t CFD1FIFOUA20bits __asm__ ("CFD1FIFOUA20") __attribute__((section("sfrs"), address(0xBF880520)));
extern volatile uint32_t        CFD1FIFOUA20CLR __attribute__((section("sfrs"),address(0xBF880524)));
extern volatile uint32_t        CFD1FIFOUA20SET __attribute__((section("sfrs"),address(0xBF880528)));
extern volatile uint32_t        CFD1FIFOUA20INV __attribute__((section("sfrs"),address(0xBF88052C)));
#define CFD1FIFOCON21 CFD1FIFOCON21
extern volatile uint32_t   CFD1FIFOCON21 __attribute__((section("sfrs"), address(0xBF880530)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON21bits_t;
extern volatile __CFD1FIFOCON21bits_t CFD1FIFOCON21bits __asm__ ("CFD1FIFOCON21") __attribute__((section("sfrs"), address(0xBF880530)));
extern volatile uint32_t        CFD1FIFOCON21CLR __attribute__((section("sfrs"),address(0xBF880534)));
extern volatile uint32_t        CFD1FIFOCON21SET __attribute__((section("sfrs"),address(0xBF880538)));
extern volatile uint32_t        CFD1FIFOCON21INV __attribute__((section("sfrs"),address(0xBF88053C)));
#define CFD1FIFOSTA21 CFD1FIFOSTA21
extern volatile uint32_t   CFD1FIFOSTA21 __attribute__((section("sfrs"), address(0xBF880540)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA21bits_t;
extern volatile __CFD1FIFOSTA21bits_t CFD1FIFOSTA21bits __asm__ ("CFD1FIFOSTA21") __attribute__((section("sfrs"), address(0xBF880540)));
extern volatile uint32_t        CFD1FIFOSTA21CLR __attribute__((section("sfrs"),address(0xBF880544)));
extern volatile uint32_t        CFD1FIFOSTA21SET __attribute__((section("sfrs"),address(0xBF880548)));
extern volatile uint32_t        CFD1FIFOSTA21INV __attribute__((section("sfrs"),address(0xBF88054C)));
#define CFD1FIFOUA21 CFD1FIFOUA21
extern volatile uint32_t   CFD1FIFOUA21 __attribute__((section("sfrs"), address(0xBF880550)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA21bits_t;
extern volatile __CFD1FIFOUA21bits_t CFD1FIFOUA21bits __asm__ ("CFD1FIFOUA21") __attribute__((section("sfrs"), address(0xBF880550)));
extern volatile uint32_t        CFD1FIFOUA21CLR __attribute__((section("sfrs"),address(0xBF880554)));
extern volatile uint32_t        CFD1FIFOUA21SET __attribute__((section("sfrs"),address(0xBF880558)));
extern volatile uint32_t        CFD1FIFOUA21INV __attribute__((section("sfrs"),address(0xBF88055C)));
#define CFD1FIFOCON22 CFD1FIFOCON22
extern volatile uint32_t   CFD1FIFOCON22 __attribute__((section("sfrs"), address(0xBF880560)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON22bits_t;
extern volatile __CFD1FIFOCON22bits_t CFD1FIFOCON22bits __asm__ ("CFD1FIFOCON22") __attribute__((section("sfrs"), address(0xBF880560)));
extern volatile uint32_t        CFD1FIFOCON22CLR __attribute__((section("sfrs"),address(0xBF880564)));
extern volatile uint32_t        CFD1FIFOCON22SET __attribute__((section("sfrs"),address(0xBF880568)));
extern volatile uint32_t        CFD1FIFOCON22INV __attribute__((section("sfrs"),address(0xBF88056C)));
#define CFD1FIFOSTA22 CFD1FIFOSTA22
extern volatile uint32_t   CFD1FIFOSTA22 __attribute__((section("sfrs"), address(0xBF880570)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA22bits_t;
extern volatile __CFD1FIFOSTA22bits_t CFD1FIFOSTA22bits __asm__ ("CFD1FIFOSTA22") __attribute__((section("sfrs"), address(0xBF880570)));
extern volatile uint32_t        CFD1FIFOSTA22CLR __attribute__((section("sfrs"),address(0xBF880574)));
extern volatile uint32_t        CFD1FIFOSTA22SET __attribute__((section("sfrs"),address(0xBF880578)));
extern volatile uint32_t        CFD1FIFOSTA22INV __attribute__((section("sfrs"),address(0xBF88057C)));
#define CFD1FIFOUA22 CFD1FIFOUA22
extern volatile uint32_t   CFD1FIFOUA22 __attribute__((section("sfrs"), address(0xBF880580)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA22bits_t;
