Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpl064.h
extern volatile __CFD2TEFCONbits_t CFD2TEFCONbits __asm__ ("CFD2TEFCON") __attribute__((section("sfrs"), address(0xBF881100)));
extern volatile uint32_t        CFD2TEFCONCLR __attribute__((section("sfrs"),address(0xBF881104)));
extern volatile uint32_t        CFD2TEFCONSET __attribute__((section("sfrs"),address(0xBF881108)));
extern volatile uint32_t        CFD2TEFCONINV __attribute__((section("sfrs"),address(0xBF88110C)));
#define CFD2TEFSTA CFD2TEFSTA
extern volatile uint32_t   CFD2TEFSTA __attribute__((section("sfrs"), address(0xBF881110)));
typedef struct {
  uint32_t TEFNEIF:1;
  uint32_t TEFHIF:1;
  uint32_t TEFFIF:1;
  uint32_t TEFOVIF:1;
} __CFD2TEFSTAbits_t;
extern volatile __CFD2TEFSTAbits_t CFD2TEFSTAbits __asm__ ("CFD2TEFSTA") __attribute__((section("sfrs"), address(0xBF881110)));
extern volatile uint32_t        CFD2TEFSTACLR __attribute__((section("sfrs"),address(0xBF881114)));
extern volatile uint32_t        CFD2TEFSTASET __attribute__((section("sfrs"),address(0xBF881118)));
extern volatile uint32_t        CFD2TEFSTAINV __attribute__((section("sfrs"),address(0xBF88111C)));
#define CFD2TEFUA CFD2TEFUA
extern volatile uint32_t   CFD2TEFUA __attribute__((section("sfrs"), address(0xBF881120)));
typedef struct {
  uint32_t TEFUA:32;
} __CFD2TEFUAbits_t;
extern volatile __CFD2TEFUAbits_t CFD2TEFUAbits __asm__ ("CFD2TEFUA") __attribute__((section("sfrs"), address(0xBF881120)));
extern volatile uint32_t        CFD2TEFUACLR __attribute__((section("sfrs"),address(0xBF881124)));
extern volatile uint32_t        CFD2TEFUASET __attribute__((section("sfrs"),address(0xBF881128)));
extern volatile uint32_t        CFD2TEFUAINV __attribute__((section("sfrs"),address(0xBF88112C)));
#define CFD2FIFOBA CFD2FIFOBA
extern volatile uint32_t   CFD2FIFOBA __attribute__((section("sfrs"), address(0xBF881130)));
typedef struct {
  uint32_t FIFOBA:32;
} __CFD2FIFOBAbits_t;
extern volatile __CFD2FIFOBAbits_t CFD2FIFOBAbits __asm__ ("CFD2FIFOBA") __attribute__((section("sfrs"), address(0xBF881130)));
extern volatile uint32_t        CFD2FIFOBACLR __attribute__((section("sfrs"),address(0xBF881134)));
extern volatile uint32_t        CFD2FIFOBASET __attribute__((section("sfrs"),address(0xBF881138)));
extern volatile uint32_t        CFD2FIFOBAINV __attribute__((section("sfrs"),address(0xBF88113C)));
#define CFD2TXQCON CFD2TXQCON
extern volatile uint32_t   CFD2TXQCON __attribute__((section("sfrs"), address(0xBF881140)));
typedef struct {
  uint32_t TXQNIE:1;
  uint32_t :1;
  uint32_t TXQEIE:1;
  uint32_t :1;
  uint32_t TXATIE:1;
  uint32_t :2;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2TXQCONbits_t;
extern volatile __CFD2TXQCONbits_t CFD2TXQCONbits __asm__ ("CFD2TXQCON") __attribute__((section("sfrs"), address(0xBF881140)));
extern volatile uint32_t        CFD2TXQCONCLR __attribute__((section("sfrs"),address(0xBF881144)));
extern volatile uint32_t        CFD2TXQCONSET __attribute__((section("sfrs"),address(0xBF881148)));
extern volatile uint32_t        CFD2TXQCONINV __attribute__((section("sfrs"),address(0xBF88114C)));
#define CFD2TXQSTA CFD2TXQSTA
extern volatile uint32_t   CFD2TXQSTA __attribute__((section("sfrs"), address(0xBF881150)));
typedef struct {
  uint32_t TXQNIF:1;
  uint32_t :1;
  uint32_t TXQEIF:1;
  uint32_t :1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t TXQCI:5;
} __CFD2TXQSTAbits_t;
extern volatile __CFD2TXQSTAbits_t CFD2TXQSTAbits __asm__ ("CFD2TXQSTA") __attribute__((section("sfrs"), address(0xBF881150)));
extern volatile uint32_t        CFD2TXQSTACLR __attribute__((section("sfrs"),address(0xBF881154)));
extern volatile uint32_t        CFD2TXQSTASET __attribute__((section("sfrs"),address(0xBF881158)));
extern volatile uint32_t        CFD2TXQSTAINV __attribute__((section("sfrs"),address(0xBF88115C)));
#define CFD2TXQUA CFD2TXQUA
extern volatile uint32_t   CFD2TXQUA __attribute__((section("sfrs"), address(0xBF881160)));
typedef struct {
  uint32_t TXQUA:32;
} __CFD2TXQUAbits_t;
extern volatile __CFD2TXQUAbits_t CFD2TXQUAbits __asm__ ("CFD2TXQUA") __attribute__((section("sfrs"), address(0xBF881160)));
extern volatile uint32_t        CFD2TXQUACLR __attribute__((section("sfrs"),address(0xBF881164)));
extern volatile uint32_t        CFD2TXQUASET __attribute__((section("sfrs"),address(0xBF881168)));
extern volatile uint32_t        CFD2TXQUAINV __attribute__((section("sfrs"),address(0xBF88116C)));
#define CFD2FIFOCON1 CFD2FIFOCON1
extern volatile uint32_t   CFD2FIFOCON1 __attribute__((section("sfrs"), address(0xBF881170)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON1bits_t;
extern volatile __CFD2FIFOCON1bits_t CFD2FIFOCON1bits __asm__ ("CFD2FIFOCON1") __attribute__((section("sfrs"), address(0xBF881170)));
extern volatile uint32_t        CFD2FIFOCON1CLR __attribute__((section("sfrs"),address(0xBF881174)));
extern volatile uint32_t        CFD2FIFOCON1SET __attribute__((section("sfrs"),address(0xBF881178)));
extern volatile uint32_t        CFD2FIFOCON1INV __attribute__((section("sfrs"),address(0xBF88117C)));
#define CFD2FIFOSTA1 CFD2FIFOSTA1
extern volatile uint32_t   CFD2FIFOSTA1 __attribute__((section("sfrs"), address(0xBF881180)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA1bits_t;
extern volatile __CFD2FIFOSTA1bits_t CFD2FIFOSTA1bits __asm__ ("CFD2FIFOSTA1") __attribute__((section("sfrs"), address(0xBF881180)));
extern volatile uint32_t        CFD2FIFOSTA1CLR __attribute__((section("sfrs"),address(0xBF881184)));
extern volatile uint32_t        CFD2FIFOSTA1SET __attribute__((section("sfrs"),address(0xBF881188)));
extern volatile uint32_t        CFD2FIFOSTA1INV __attribute__((section("sfrs"),address(0xBF88118C)));
#define CFD2FIFOUA1 CFD2FIFOUA1
extern volatile uint32_t   CFD2FIFOUA1 __attribute__((section("sfrs"), address(0xBF881190)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA1bits_t;
extern volatile __CFD2FIFOUA1bits_t CFD2FIFOUA1bits __asm__ ("CFD2FIFOUA1") __attribute__((section("sfrs"), address(0xBF881190)));
extern volatile uint32_t        CFD2FIFOUA1CLR __attribute__((section("sfrs"),address(0xBF881194)));
extern volatile uint32_t        CFD2FIFOUA1SET __attribute__((section("sfrs"),address(0xBF881198)));
extern volatile uint32_t        CFD2FIFOUA1INV __attribute__((section("sfrs"),address(0xBF88119C)));
#define CFD2FIFOCON2 CFD2FIFOCON2
extern volatile uint32_t   CFD2FIFOCON2 __attribute__((section("sfrs"), address(0xBF8811A0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON2bits_t;
extern volatile __CFD2FIFOCON2bits_t CFD2FIFOCON2bits __asm__ ("CFD2FIFOCON2") __attribute__((section("sfrs"), address(0xBF8811A0)));
extern volatile uint32_t        CFD2FIFOCON2CLR __attribute__((section("sfrs"),address(0xBF8811A4)));
extern volatile uint32_t        CFD2FIFOCON2SET __attribute__((section("sfrs"),address(0xBF8811A8)));
extern volatile uint32_t        CFD2FIFOCON2INV __attribute__((section("sfrs"),address(0xBF8811AC)));
#define CFD2FIFOSTA2 CFD2FIFOSTA2
extern volatile uint32_t   CFD2FIFOSTA2 __attribute__((section("sfrs"), address(0xBF8811B0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA2bits_t;
