Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpl064.h
extern volatile __CFD2FIFOUA5bits_t CFD2FIFOUA5bits __asm__ ("CFD2FIFOUA5") __attribute__((section("sfrs"), address(0xBF881250)));
extern volatile uint32_t        CFD2FIFOUA5CLR __attribute__((section("sfrs"),address(0xBF881254)));
extern volatile uint32_t        CFD2FIFOUA5SET __attribute__((section("sfrs"),address(0xBF881258)));
extern volatile uint32_t        CFD2FIFOUA5INV __attribute__((section("sfrs"),address(0xBF88125C)));
#define CFD2FIFOCON6 CFD2FIFOCON6
extern volatile uint32_t   CFD2FIFOCON6 __attribute__((section("sfrs"), address(0xBF881260)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON6bits_t;
extern volatile __CFD2FIFOCON6bits_t CFD2FIFOCON6bits __asm__ ("CFD2FIFOCON6") __attribute__((section("sfrs"), address(0xBF881260)));
extern volatile uint32_t        CFD2FIFOCON6CLR __attribute__((section("sfrs"),address(0xBF881264)));
extern volatile uint32_t        CFD2FIFOCON6SET __attribute__((section("sfrs"),address(0xBF881268)));
extern volatile uint32_t        CFD2FIFOCON6INV __attribute__((section("sfrs"),address(0xBF88126C)));
#define CFD2FIFOSTA6 CFD2FIFOSTA6
extern volatile uint32_t   CFD2FIFOSTA6 __attribute__((section("sfrs"), address(0xBF881270)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA6bits_t;
extern volatile __CFD2FIFOSTA6bits_t CFD2FIFOSTA6bits __asm__ ("CFD2FIFOSTA6") __attribute__((section("sfrs"), address(0xBF881270)));
extern volatile uint32_t        CFD2FIFOSTA6CLR __attribute__((section("sfrs"),address(0xBF881274)));
extern volatile uint32_t        CFD2FIFOSTA6SET __attribute__((section("sfrs"),address(0xBF881278)));
extern volatile uint32_t        CFD2FIFOSTA6INV __attribute__((section("sfrs"),address(0xBF88127C)));
#define CFD2FIFOUA6 CFD2FIFOUA6
extern volatile uint32_t   CFD2FIFOUA6 __attribute__((section("sfrs"), address(0xBF881280)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA6bits_t;
extern volatile __CFD2FIFOUA6bits_t CFD2FIFOUA6bits __asm__ ("CFD2FIFOUA6") __attribute__((section("sfrs"), address(0xBF881280)));
extern volatile uint32_t        CFD2FIFOUA6CLR __attribute__((section("sfrs"),address(0xBF881284)));
extern volatile uint32_t        CFD2FIFOUA6SET __attribute__((section("sfrs"),address(0xBF881288)));
extern volatile uint32_t        CFD2FIFOUA6INV __attribute__((section("sfrs"),address(0xBF88128C)));
#define CFD2FIFOCON7 CFD2FIFOCON7
extern volatile uint32_t   CFD2FIFOCON7 __attribute__((section("sfrs"), address(0xBF881290)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON7bits_t;
extern volatile __CFD2FIFOCON7bits_t CFD2FIFOCON7bits __asm__ ("CFD2FIFOCON7") __attribute__((section("sfrs"), address(0xBF881290)));
extern volatile uint32_t        CFD2FIFOCON7CLR __attribute__((section("sfrs"),address(0xBF881294)));
extern volatile uint32_t        CFD2FIFOCON7SET __attribute__((section("sfrs"),address(0xBF881298)));
extern volatile uint32_t        CFD2FIFOCON7INV __attribute__((section("sfrs"),address(0xBF88129C)));
#define CFD2FIFOSTA7 CFD2FIFOSTA7
extern volatile uint32_t   CFD2FIFOSTA7 __attribute__((section("sfrs"), address(0xBF8812A0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA7bits_t;
extern volatile __CFD2FIFOSTA7bits_t CFD2FIFOSTA7bits __asm__ ("CFD2FIFOSTA7") __attribute__((section("sfrs"), address(0xBF8812A0)));
extern volatile uint32_t        CFD2FIFOSTA7CLR __attribute__((section("sfrs"),address(0xBF8812A4)));
extern volatile uint32_t        CFD2FIFOSTA7SET __attribute__((section("sfrs"),address(0xBF8812A8)));
extern volatile uint32_t        CFD2FIFOSTA7INV __attribute__((section("sfrs"),address(0xBF8812AC)));
#define CFD2FIFOUA7 CFD2FIFOUA7
extern volatile uint32_t   CFD2FIFOUA7 __attribute__((section("sfrs"), address(0xBF8812B0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA7bits_t;
extern volatile __CFD2FIFOUA7bits_t CFD2FIFOUA7bits __asm__ ("CFD2FIFOUA7") __attribute__((section("sfrs"), address(0xBF8812B0)));
extern volatile uint32_t        CFD2FIFOUA7CLR __attribute__((section("sfrs"),address(0xBF8812B4)));
extern volatile uint32_t        CFD2FIFOUA7SET __attribute__((section("sfrs"),address(0xBF8812B8)));
extern volatile uint32_t        CFD2FIFOUA7INV __attribute__((section("sfrs"),address(0xBF8812BC)));
#define CFD2FIFOCON8 CFD2FIFOCON8
extern volatile uint32_t   CFD2FIFOCON8 __attribute__((section("sfrs"), address(0xBF8812C0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON8bits_t;
extern volatile __CFD2FIFOCON8bits_t CFD2FIFOCON8bits __asm__ ("CFD2FIFOCON8") __attribute__((section("sfrs"), address(0xBF8812C0)));
extern volatile uint32_t        CFD2FIFOCON8CLR __attribute__((section("sfrs"),address(0xBF8812C4)));
extern volatile uint32_t        CFD2FIFOCON8SET __attribute__((section("sfrs"),address(0xBF8812C8)));
extern volatile uint32_t        CFD2FIFOCON8INV __attribute__((section("sfrs"),address(0xBF8812CC)));
#define CFD2FIFOSTA8 CFD2FIFOSTA8
extern volatile uint32_t   CFD2FIFOSTA8 __attribute__((section("sfrs"), address(0xBF8812D0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA8bits_t;
extern volatile __CFD2FIFOSTA8bits_t CFD2FIFOSTA8bits __asm__ ("CFD2FIFOSTA8") __attribute__((section("sfrs"), address(0xBF8812D0)));
extern volatile uint32_t        CFD2FIFOSTA8CLR __attribute__((section("sfrs"),address(0xBF8812D4)));
extern volatile uint32_t        CFD2FIFOSTA8SET __attribute__((section("sfrs"),address(0xBF8812D8)));
extern volatile uint32_t        CFD2FIFOSTA8INV __attribute__((section("sfrs"),address(0xBF8812DC)));
#define CFD2FIFOUA8 CFD2FIFOUA8
extern volatile uint32_t   CFD2FIFOUA8 __attribute__((section("sfrs"), address(0xBF8812E0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA8bits_t;
