Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpl064.h
extern volatile __CFD2FIFOCON12bits_t CFD2FIFOCON12bits __asm__ ("CFD2FIFOCON12") __attribute__((section("sfrs"), address(0xBF881380)));
extern volatile uint32_t        CFD2FIFOCON12CLR __attribute__((section("sfrs"),address(0xBF881384)));
extern volatile uint32_t        CFD2FIFOCON12SET __attribute__((section("sfrs"),address(0xBF881388)));
extern volatile uint32_t        CFD2FIFOCON12INV __attribute__((section("sfrs"),address(0xBF88138C)));
#define CFD2FIFOSTA12 CFD2FIFOSTA12
extern volatile uint32_t   CFD2FIFOSTA12 __attribute__((section("sfrs"), address(0xBF881390)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA12bits_t;
extern volatile __CFD2FIFOSTA12bits_t CFD2FIFOSTA12bits __asm__ ("CFD2FIFOSTA12") __attribute__((section("sfrs"), address(0xBF881390)));
extern volatile uint32_t        CFD2FIFOSTA12CLR __attribute__((section("sfrs"),address(0xBF881394)));
extern volatile uint32_t        CFD2FIFOSTA12SET __attribute__((section("sfrs"),address(0xBF881398)));
extern volatile uint32_t        CFD2FIFOSTA12INV __attribute__((section("sfrs"),address(0xBF88139C)));
#define CFD2FIFOUA12 CFD2FIFOUA12
extern volatile uint32_t   CFD2FIFOUA12 __attribute__((section("sfrs"), address(0xBF8813A0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA12bits_t;
extern volatile __CFD2FIFOUA12bits_t CFD2FIFOUA12bits __asm__ ("CFD2FIFOUA12") __attribute__((section("sfrs"), address(0xBF8813A0)));
extern volatile uint32_t        CFD2FIFOUA12CLR __attribute__((section("sfrs"),address(0xBF8813A4)));
extern volatile uint32_t        CFD2FIFOUA12SET __attribute__((section("sfrs"),address(0xBF8813A8)));
extern volatile uint32_t        CFD2FIFOUA12INV __attribute__((section("sfrs"),address(0xBF8813AC)));
#define CFD2FIFOCON13 CFD2FIFOCON13
extern volatile uint32_t   CFD2FIFOCON13 __attribute__((section("sfrs"), address(0xBF8813B0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON13bits_t;
extern volatile __CFD2FIFOCON13bits_t CFD2FIFOCON13bits __asm__ ("CFD2FIFOCON13") __attribute__((section("sfrs"), address(0xBF8813B0)));
extern volatile uint32_t        CFD2FIFOCON13CLR __attribute__((section("sfrs"),address(0xBF8813B4)));
extern volatile uint32_t        CFD2FIFOCON13SET __attribute__((section("sfrs"),address(0xBF8813B8)));
extern volatile uint32_t        CFD2FIFOCON13INV __attribute__((section("sfrs"),address(0xBF8813BC)));
#define CFD2FIFOSTA13 CFD2FIFOSTA13
extern volatile uint32_t   CFD2FIFOSTA13 __attribute__((section("sfrs"), address(0xBF8813C0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA13bits_t;
extern volatile __CFD2FIFOSTA13bits_t CFD2FIFOSTA13bits __asm__ ("CFD2FIFOSTA13") __attribute__((section("sfrs"), address(0xBF8813C0)));
extern volatile uint32_t        CFD2FIFOSTA13CLR __attribute__((section("sfrs"),address(0xBF8813C4)));
extern volatile uint32_t        CFD2FIFOSTA13SET __attribute__((section("sfrs"),address(0xBF8813C8)));
extern volatile uint32_t        CFD2FIFOSTA13INV __attribute__((section("sfrs"),address(0xBF8813CC)));
#define CFD2FIFOUA13 CFD2FIFOUA13
extern volatile uint32_t   CFD2FIFOUA13 __attribute__((section("sfrs"), address(0xBF8813D0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA13bits_t;
extern volatile __CFD2FIFOUA13bits_t CFD2FIFOUA13bits __asm__ ("CFD2FIFOUA13") __attribute__((section("sfrs"), address(0xBF8813D0)));
extern volatile uint32_t        CFD2FIFOUA13CLR __attribute__((section("sfrs"),address(0xBF8813D4)));
extern volatile uint32_t        CFD2FIFOUA13SET __attribute__((section("sfrs"),address(0xBF8813D8)));
extern volatile uint32_t        CFD2FIFOUA13INV __attribute__((section("sfrs"),address(0xBF8813DC)));
#define CFD2FIFOCON14 CFD2FIFOCON14
extern volatile uint32_t   CFD2FIFOCON14 __attribute__((section("sfrs"), address(0xBF8813E0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON14bits_t;
extern volatile __CFD2FIFOCON14bits_t CFD2FIFOCON14bits __asm__ ("CFD2FIFOCON14") __attribute__((section("sfrs"), address(0xBF8813E0)));
extern volatile uint32_t        CFD2FIFOCON14CLR __attribute__((section("sfrs"),address(0xBF8813E4)));
extern volatile uint32_t        CFD2FIFOCON14SET __attribute__((section("sfrs"),address(0xBF8813E8)));
extern volatile uint32_t        CFD2FIFOCON14INV __attribute__((section("sfrs"),address(0xBF8813EC)));
#define CFD2FIFOSTA14 CFD2FIFOSTA14
extern volatile uint32_t   CFD2FIFOSTA14 __attribute__((section("sfrs"), address(0xBF8813F0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA14bits_t;
extern volatile __CFD2FIFOSTA14bits_t CFD2FIFOSTA14bits __asm__ ("CFD2FIFOSTA14") __attribute__((section("sfrs"), address(0xBF8813F0)));
extern volatile uint32_t        CFD2FIFOSTA14CLR __attribute__((section("sfrs"),address(0xBF8813F4)));
extern volatile uint32_t        CFD2FIFOSTA14SET __attribute__((section("sfrs"),address(0xBF8813F8)));
extern volatile uint32_t        CFD2FIFOSTA14INV __attribute__((section("sfrs"),address(0xBF8813FC)));
#define CFD2FIFOUA14 CFD2FIFOUA14
extern volatile uint32_t   CFD2FIFOUA14 __attribute__((section("sfrs"), address(0xBF881400)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA14bits_t;
extern volatile __CFD2FIFOUA14bits_t CFD2FIFOUA14bits __asm__ ("CFD2FIFOUA14") __attribute__((section("sfrs"), address(0xBF881400)));
extern volatile uint32_t        CFD2FIFOUA14CLR __attribute__((section("sfrs"),address(0xBF881404)));
extern volatile uint32_t        CFD2FIFOUA14SET __attribute__((section("sfrs"),address(0xBF881408)));
extern volatile uint32_t        CFD2FIFOUA14INV __attribute__((section("sfrs"),address(0xBF88140C)));
#define CFD2FIFOCON15 CFD2FIFOCON15
extern volatile uint32_t   CFD2FIFOCON15 __attribute__((section("sfrs"), address(0xBF881410)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON15bits_t;
extern volatile __CFD2FIFOCON15bits_t CFD2FIFOCON15bits __asm__ ("CFD2FIFOCON15") __attribute__((section("sfrs"), address(0xBF881410)));
extern volatile uint32_t        CFD2FIFOCON15CLR __attribute__((section("sfrs"),address(0xBF881414)));
extern volatile uint32_t        CFD2FIFOCON15SET __attribute__((section("sfrs"),address(0xBF881418)));
extern volatile uint32_t        CFD2FIFOCON15INV __attribute__((section("sfrs"),address(0xBF88141C)));
#define CFD2FIFOSTA15 CFD2FIFOSTA15
extern volatile uint32_t   CFD2FIFOSTA15 __attribute__((section("sfrs"), address(0xBF881420)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA15bits_t;
extern volatile __CFD2FIFOSTA15bits_t CFD2FIFOSTA15bits __asm__ ("CFD2FIFOSTA15") __attribute__((section("sfrs"), address(0xBF881420)));
extern volatile uint32_t        CFD2FIFOSTA15CLR __attribute__((section("sfrs"),address(0xBF881424)));
extern volatile uint32_t        CFD2FIFOSTA15SET __attribute__((section("sfrs"),address(0xBF881428)));
extern volatile uint32_t        CFD2FIFOSTA15INV __attribute__((section("sfrs"),address(0xBF88142C)));
#define CFD2FIFOUA15 CFD2FIFOUA15
extern volatile uint32_t   CFD2FIFOUA15 __attribute__((section("sfrs"), address(0xBF881430)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA15bits_t;
