Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpl064.h
extern volatile __CFD3MASK3bits_t CFD3MASK3bits __asm__ ("CFD3MASK3") __attribute__((section("sfrs"), address(0xBF884830)));
extern volatile uint32_t        CFD3MASK3CLR __attribute__((section("sfrs"),address(0xBF884834)));
extern volatile uint32_t        CFD3MASK3SET __attribute__((section("sfrs"),address(0xBF884838)));
extern volatile uint32_t        CFD3MASK3INV __attribute__((section("sfrs"),address(0xBF88483C)));
#define CFD3FLTOBJ4 CFD3FLTOBJ4
extern volatile uint32_t   CFD3FLTOBJ4 __attribute__((section("sfrs"), address(0xBF884840)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ4bits_t;
extern volatile __CFD3FLTOBJ4bits_t CFD3FLTOBJ4bits __asm__ ("CFD3FLTOBJ4") __attribute__((section("sfrs"), address(0xBF884840)));
extern volatile uint32_t        CFD3FLTOBJ4CLR __attribute__((section("sfrs"),address(0xBF884844)));
extern volatile uint32_t        CFD3FLTOBJ4SET __attribute__((section("sfrs"),address(0xBF884848)));
extern volatile uint32_t        CFD3FLTOBJ4INV __attribute__((section("sfrs"),address(0xBF88484C)));
#define CFD3MASK4 CFD3MASK4
extern volatile uint32_t   CFD3MASK4 __attribute__((section("sfrs"), address(0xBF884850)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK4bits_t;
extern volatile __CFD3MASK4bits_t CFD3MASK4bits __asm__ ("CFD3MASK4") __attribute__((section("sfrs"), address(0xBF884850)));
extern volatile uint32_t        CFD3MASK4CLR __attribute__((section("sfrs"),address(0xBF884854)));
extern volatile uint32_t        CFD3MASK4SET __attribute__((section("sfrs"),address(0xBF884858)));
extern volatile uint32_t        CFD3MASK4INV __attribute__((section("sfrs"),address(0xBF88485C)));
#define CFD3FLTOBJ5 CFD3FLTOBJ5
extern volatile uint32_t   CFD3FLTOBJ5 __attribute__((section("sfrs"), address(0xBF884860)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ5bits_t;
extern volatile __CFD3FLTOBJ5bits_t CFD3FLTOBJ5bits __asm__ ("CFD3FLTOBJ5") __attribute__((section("sfrs"), address(0xBF884860)));
extern volatile uint32_t        CFD3FLTOBJ5CLR __attribute__((section("sfrs"),address(0xBF884864)));
extern volatile uint32_t        CFD3FLTOBJ5SET __attribute__((section("sfrs"),address(0xBF884868)));
extern volatile uint32_t        CFD3FLTOBJ5INV __attribute__((section("sfrs"),address(0xBF88486C)));
#define CFD3MASK5 CFD3MASK5
extern volatile uint32_t   CFD3MASK5 __attribute__((section("sfrs"), address(0xBF884870)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK5bits_t;
extern volatile __CFD3MASK5bits_t CFD3MASK5bits __asm__ ("CFD3MASK5") __attribute__((section("sfrs"), address(0xBF884870)));
extern volatile uint32_t        CFD3MASK5CLR __attribute__((section("sfrs"),address(0xBF884874)));
extern volatile uint32_t        CFD3MASK5SET __attribute__((section("sfrs"),address(0xBF884878)));
extern volatile uint32_t        CFD3MASK5INV __attribute__((section("sfrs"),address(0xBF88487C)));
#define CFD3FLTOBJ6 CFD3FLTOBJ6
extern volatile uint32_t   CFD3FLTOBJ6 __attribute__((section("sfrs"), address(0xBF884880)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ6bits_t;
extern volatile __CFD3FLTOBJ6bits_t CFD3FLTOBJ6bits __asm__ ("CFD3FLTOBJ6") __attribute__((section("sfrs"), address(0xBF884880)));
extern volatile uint32_t        CFD3FLTOBJ6CLR __attribute__((section("sfrs"),address(0xBF884884)));
extern volatile uint32_t        CFD3FLTOBJ6SET __attribute__((section("sfrs"),address(0xBF884888)));
extern volatile uint32_t        CFD3FLTOBJ6INV __attribute__((section("sfrs"),address(0xBF88488C)));
#define CFD3MASK6 CFD3MASK6
extern volatile uint32_t   CFD3MASK6 __attribute__((section("sfrs"), address(0xBF884890)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK6bits_t;
extern volatile __CFD3MASK6bits_t CFD3MASK6bits __asm__ ("CFD3MASK6") __attribute__((section("sfrs"), address(0xBF884890)));
extern volatile uint32_t        CFD3MASK6CLR __attribute__((section("sfrs"),address(0xBF884894)));
extern volatile uint32_t        CFD3MASK6SET __attribute__((section("sfrs"),address(0xBF884898)));
extern volatile uint32_t        CFD3MASK6INV __attribute__((section("sfrs"),address(0xBF88489C)));
#define CFD3FLTOBJ7 CFD3FLTOBJ7
extern volatile uint32_t   CFD3FLTOBJ7 __attribute__((section("sfrs"), address(0xBF8848A0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ7bits_t;
extern volatile __CFD3FLTOBJ7bits_t CFD3FLTOBJ7bits __asm__ ("CFD3FLTOBJ7") __attribute__((section("sfrs"), address(0xBF8848A0)));
extern volatile uint32_t        CFD3FLTOBJ7CLR __attribute__((section("sfrs"),address(0xBF8848A4)));
extern volatile uint32_t        CFD3FLTOBJ7SET __attribute__((section("sfrs"),address(0xBF8848A8)));
extern volatile uint32_t        CFD3FLTOBJ7INV __attribute__((section("sfrs"),address(0xBF8848AC)));
#define CFD3MASK7 CFD3MASK7
extern volatile uint32_t   CFD3MASK7 __attribute__((section("sfrs"), address(0xBF8848B0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK7bits_t;
extern volatile __CFD3MASK7bits_t CFD3MASK7bits __asm__ ("CFD3MASK7") __attribute__((section("sfrs"), address(0xBF8848B0)));
extern volatile uint32_t        CFD3MASK7CLR __attribute__((section("sfrs"),address(0xBF8848B4)));
extern volatile uint32_t        CFD3MASK7SET __attribute__((section("sfrs"),address(0xBF8848B8)));
#define CFD3FLTOBJ8 CFD3FLTOBJ8
extern volatile uint32_t   CFD3FLTOBJ8 __attribute__((section("sfrs"), address(0xBF8848C0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ8bits_t;
extern volatile __CFD3FLTOBJ8bits_t CFD3FLTOBJ8bits __asm__ ("CFD3FLTOBJ8") __attribute__((section("sfrs"), address(0xBF8848C0)));
extern volatile uint32_t        CFD3FLTOBJ8CLR __attribute__((section("sfrs"),address(0xBF8848C4)));
extern volatile uint32_t        CFD3FLTOBJ8SET __attribute__((section("sfrs"),address(0xBF8848C8)));
extern volatile uint32_t        CFD3FLTOBJ8INV __attribute__((section("sfrs"),address(0xBF8848CC)));
#define CFD3MASK8 CFD3MASK8
extern volatile uint32_t   CFD3MASK8 __attribute__((section("sfrs"), address(0xBF8848D0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK8bits_t;
extern volatile __CFD3MASK8bits_t CFD3MASK8bits __asm__ ("CFD3MASK8") __attribute__((section("sfrs"), address(0xBF8848D0)));
extern volatile uint32_t        CFD3MASK8CLR __attribute__((section("sfrs"),address(0xBF8848D4)));
extern volatile uint32_t        CFD3MASK8SET __attribute__((section("sfrs"),address(0xBF8848D8)));
extern volatile uint32_t        CFD3MASK8INV __attribute__((section("sfrs"),address(0xBF8848DC)));
#define CFD3FLTOBJ9 CFD3FLTOBJ9
extern volatile uint32_t   CFD3FLTOBJ9 __attribute__((section("sfrs"), address(0xBF8848E0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ9bits_t;
extern volatile __CFD3FLTOBJ9bits_t CFD3FLTOBJ9bits __asm__ ("CFD3FLTOBJ9") __attribute__((section("sfrs"), address(0xBF8848E0)));
extern volatile uint32_t        CFD3FLTOBJ9CLR __attribute__((section("sfrs"),address(0xBF8848E4)));
extern volatile uint32_t        CFD3FLTOBJ9SET __attribute__((section("sfrs"),address(0xBF8848E8)));
extern volatile uint32_t        CFD3FLTOBJ9INV __attribute__((section("sfrs"),address(0xBF8848EC)));
#define CFD3MASK9 CFD3MASK9
extern volatile uint32_t   CFD3MASK9 __attribute__((section("sfrs"), address(0xBF8848F0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK9bits_t;
extern volatile __CFD3MASK9bits_t CFD3MASK9bits __asm__ ("CFD3MASK9") __attribute__((section("sfrs"), address(0xBF8848F0)));
extern volatile uint32_t        CFD3MASK9CLR __attribute__((section("sfrs"),address(0xBF8848F4)));
extern volatile uint32_t        CFD3MASK9SET __attribute__((section("sfrs"),address(0xBF8848F8)));
extern volatile uint32_t        CFD3MASK9INV __attribute__((section("sfrs"),address(0xBF8848FC)));
#define CFD3FLTOBJ10 CFD3FLTOBJ10
extern volatile uint32_t   CFD3FLTOBJ10 __attribute__((section("sfrs"), address(0xBF884900)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ10bits_t;
