Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpl064.h
extern volatile __CFD4FIFOSTA14bits_t CFD4FIFOSTA14bits __asm__ ("CFD4FIFOSTA14") __attribute__((section("sfrs"), address(0xBF8853F0)));
extern volatile uint32_t        CFD4FIFOSTA14CLR __attribute__((section("sfrs"),address(0xBF8853F4)));
extern volatile uint32_t        CFD4FIFOSTA14SET __attribute__((section("sfrs"),address(0xBF8853F8)));
extern volatile uint32_t        CFD4FIFOSTA14INV __attribute__((section("sfrs"),address(0xBF8853FC)));
#define CFD4FIFOUA14 CFD4FIFOUA14
extern volatile uint32_t   CFD4FIFOUA14 __attribute__((section("sfrs"), address(0xBF885400)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA14bits_t;
extern volatile __CFD4FIFOUA14bits_t CFD4FIFOUA14bits __asm__ ("CFD4FIFOUA14") __attribute__((section("sfrs"), address(0xBF885400)));
extern volatile uint32_t        CFD4FIFOUA14CLR __attribute__((section("sfrs"),address(0xBF885404)));
extern volatile uint32_t        CFD4FIFOUA14SET __attribute__((section("sfrs"),address(0xBF885408)));
extern volatile uint32_t        CFD4FIFOUA14INV __attribute__((section("sfrs"),address(0xBF88540C)));
#define CFD4FIFOCON15 CFD4FIFOCON15
extern volatile uint32_t   CFD4FIFOCON15 __attribute__((section("sfrs"), address(0xBF885410)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON15bits_t;
extern volatile __CFD4FIFOCON15bits_t CFD4FIFOCON15bits __asm__ ("CFD4FIFOCON15") __attribute__((section("sfrs"), address(0xBF885410)));
extern volatile uint32_t        CFD4FIFOCON15CLR __attribute__((section("sfrs"),address(0xBF885414)));
extern volatile uint32_t        CFD4FIFOCON15SET __attribute__((section("sfrs"),address(0xBF885418)));
extern volatile uint32_t        CFD4FIFOCON15INV __attribute__((section("sfrs"),address(0xBF88541C)));
#define CFD4FIFOSTA15 CFD4FIFOSTA15
extern volatile uint32_t   CFD4FIFOSTA15 __attribute__((section("sfrs"), address(0xBF885420)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA15bits_t;
extern volatile __CFD4FIFOSTA15bits_t CFD4FIFOSTA15bits __asm__ ("CFD4FIFOSTA15") __attribute__((section("sfrs"), address(0xBF885420)));
extern volatile uint32_t        CFD4FIFOSTA15CLR __attribute__((section("sfrs"),address(0xBF885424)));
extern volatile uint32_t        CFD4FIFOSTA15SET __attribute__((section("sfrs"),address(0xBF885428)));
extern volatile uint32_t        CFD4FIFOSTA15INV __attribute__((section("sfrs"),address(0xBF88542C)));
#define CFD4FIFOUA15 CFD4FIFOUA15
extern volatile uint32_t   CFD4FIFOUA15 __attribute__((section("sfrs"), address(0xBF885430)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA15bits_t;
extern volatile __CFD4FIFOUA15bits_t CFD4FIFOUA15bits __asm__ ("CFD4FIFOUA15") __attribute__((section("sfrs"), address(0xBF885430)));
extern volatile uint32_t        CFD4FIFOUA15CLR __attribute__((section("sfrs"),address(0xBF885434)));
extern volatile uint32_t        CFD4FIFOUA15SET __attribute__((section("sfrs"),address(0xBF885438)));
extern volatile uint32_t        CFD4FIFOUA15INV __attribute__((section("sfrs"),address(0xBF88543C)));
#define CFD4FIFOCON16 CFD4FIFOCON16
extern volatile uint32_t   CFD4FIFOCON16 __attribute__((section("sfrs"), address(0xBF885440)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON16bits_t;
extern volatile __CFD4FIFOCON16bits_t CFD4FIFOCON16bits __asm__ ("CFD4FIFOCON16") __attribute__((section("sfrs"), address(0xBF885440)));
extern volatile uint32_t        CFD4FIFOCON16CLR __attribute__((section("sfrs"),address(0xBF885444)));
extern volatile uint32_t        CFD4FIFOCON16SET __attribute__((section("sfrs"),address(0xBF885448)));
extern volatile uint32_t        CFD4FIFOCON16INV __attribute__((section("sfrs"),address(0xBF88544C)));
#define CFD4FIFOSTA16 CFD4FIFOSTA16
extern volatile uint32_t   CFD4FIFOSTA16 __attribute__((section("sfrs"), address(0xBF885450)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA16bits_t;
extern volatile __CFD4FIFOSTA16bits_t CFD4FIFOSTA16bits __asm__ ("CFD4FIFOSTA16") __attribute__((section("sfrs"), address(0xBF885450)));
extern volatile uint32_t        CFD4FIFOSTA16CLR __attribute__((section("sfrs"),address(0xBF885454)));
extern volatile uint32_t        CFD4FIFOSTA16SET __attribute__((section("sfrs"),address(0xBF885458)));
extern volatile uint32_t        CFD4FIFOSTA16INV __attribute__((section("sfrs"),address(0xBF88545C)));
#define CFD4FIFOUA16 CFD4FIFOUA16
extern volatile uint32_t   CFD4FIFOUA16 __attribute__((section("sfrs"), address(0xBF885460)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA16bits_t;
extern volatile __CFD4FIFOUA16bits_t CFD4FIFOUA16bits __asm__ ("CFD4FIFOUA16") __attribute__((section("sfrs"), address(0xBF885460)));
extern volatile uint32_t        CFD4FIFOUA16CLR __attribute__((section("sfrs"),address(0xBF885464)));
extern volatile uint32_t        CFD4FIFOUA16SET __attribute__((section("sfrs"),address(0xBF885468)));
extern volatile uint32_t        CFD4FIFOUA16INV __attribute__((section("sfrs"),address(0xBF88546C)));
#define CFD4FIFOCON17 CFD4FIFOCON17
extern volatile uint32_t   CFD4FIFOCON17 __attribute__((section("sfrs"), address(0xBF885470)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON17bits_t;
