Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpl064.h
extern volatile __CFD4MASK1bits_t CFD4MASK1bits __asm__ ("CFD4MASK1") __attribute__((section("sfrs"), address(0xBF8857F0)));
extern volatile uint32_t        CFD4MASK1CLR __attribute__((section("sfrs"),address(0xBF8857F4)));
extern volatile uint32_t        CFD4MASK1SET __attribute__((section("sfrs"),address(0xBF8857F8)));
extern volatile uint32_t        CFD4MASK1INV __attribute__((section("sfrs"),address(0xBF8857FC)));
#define CFD4FLTOBJ2 CFD4FLTOBJ2
extern volatile uint32_t   CFD4FLTOBJ2 __attribute__((section("sfrs"), address(0xBF885800)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ2bits_t;
extern volatile __CFD4FLTOBJ2bits_t CFD4FLTOBJ2bits __asm__ ("CFD4FLTOBJ2") __attribute__((section("sfrs"), address(0xBF885800)));
extern volatile uint32_t        CFD4FLTOBJ2CLR __attribute__((section("sfrs"),address(0xBF885804)));
extern volatile uint32_t        CFD4FLTOBJ2SET __attribute__((section("sfrs"),address(0xBF885808)));
extern volatile uint32_t        CFD4FLTOBJ2INV __attribute__((section("sfrs"),address(0xBF88580C)));
#define CFD4MASK2 CFD4MASK2
extern volatile uint32_t   CFD4MASK2 __attribute__((section("sfrs"), address(0xBF885810)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK2bits_t;
extern volatile __CFD4MASK2bits_t CFD4MASK2bits __asm__ ("CFD4MASK2") __attribute__((section("sfrs"), address(0xBF885810)));
extern volatile uint32_t        CFD4MASK2CLR __attribute__((section("sfrs"),address(0xBF885814)));
extern volatile uint32_t        CFD4MASK2SET __attribute__((section("sfrs"),address(0xBF885818)));
extern volatile uint32_t        CFD4MASK2INV __attribute__((section("sfrs"),address(0xBF88581C)));
#define CFD4FLTOBJ3 CFD4FLTOBJ3
extern volatile uint32_t   CFD4FLTOBJ3 __attribute__((section("sfrs"), address(0xBF885820)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ3bits_t;
extern volatile __CFD4FLTOBJ3bits_t CFD4FLTOBJ3bits __asm__ ("CFD4FLTOBJ3") __attribute__((section("sfrs"), address(0xBF885820)));
extern volatile uint32_t        CFD4FLTOBJ3CLR __attribute__((section("sfrs"),address(0xBF885824)));
extern volatile uint32_t        CFD4FLTOBJ3SET __attribute__((section("sfrs"),address(0xBF885828)));
extern volatile uint32_t        CFD4FLTOBJ3INV __attribute__((section("sfrs"),address(0xBF88582C)));
#define CFD4MASK3 CFD4MASK3
extern volatile uint32_t   CFD4MASK3 __attribute__((section("sfrs"), address(0xBF885830)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK3bits_t;
extern volatile __CFD4MASK3bits_t CFD4MASK3bits __asm__ ("CFD4MASK3") __attribute__((section("sfrs"), address(0xBF885830)));
extern volatile uint32_t        CFD4MASK3CLR __attribute__((section("sfrs"),address(0xBF885834)));
extern volatile uint32_t        CFD4MASK3SET __attribute__((section("sfrs"),address(0xBF885838)));
extern volatile uint32_t        CFD4MASK3INV __attribute__((section("sfrs"),address(0xBF88583C)));
#define CFD4FLTOBJ4 CFD4FLTOBJ4
extern volatile uint32_t   CFD4FLTOBJ4 __attribute__((section("sfrs"), address(0xBF885840)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ4bits_t;
extern volatile __CFD4FLTOBJ4bits_t CFD4FLTOBJ4bits __asm__ ("CFD4FLTOBJ4") __attribute__((section("sfrs"), address(0xBF885840)));
extern volatile uint32_t        CFD4FLTOBJ4CLR __attribute__((section("sfrs"),address(0xBF885844)));
extern volatile uint32_t        CFD4FLTOBJ4SET __attribute__((section("sfrs"),address(0xBF885848)));
extern volatile uint32_t        CFD4FLTOBJ4INV __attribute__((section("sfrs"),address(0xBF88584C)));
#define CFD4MASK4 CFD4MASK4
extern volatile uint32_t   CFD4MASK4 __attribute__((section("sfrs"), address(0xBF885850)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK4bits_t;
extern volatile __CFD4MASK4bits_t CFD4MASK4bits __asm__ ("CFD4MASK4") __attribute__((section("sfrs"), address(0xBF885850)));
extern volatile uint32_t        CFD4MASK4CLR __attribute__((section("sfrs"),address(0xBF885854)));
extern volatile uint32_t        CFD4MASK4SET __attribute__((section("sfrs"),address(0xBF885858)));
extern volatile uint32_t        CFD4MASK4INV __attribute__((section("sfrs"),address(0xBF88585C)));
#define CFD4FLTOBJ5 CFD4FLTOBJ5
extern volatile uint32_t   CFD4FLTOBJ5 __attribute__((section("sfrs"), address(0xBF885860)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ5bits_t;
extern volatile __CFD4FLTOBJ5bits_t CFD4FLTOBJ5bits __asm__ ("CFD4FLTOBJ5") __attribute__((section("sfrs"), address(0xBF885860)));
extern volatile uint32_t        CFD4FLTOBJ5CLR __attribute__((section("sfrs"),address(0xBF885864)));
extern volatile uint32_t        CFD4FLTOBJ5SET __attribute__((section("sfrs"),address(0xBF885868)));
extern volatile uint32_t        CFD4FLTOBJ5INV __attribute__((section("sfrs"),address(0xBF88586C)));
#define CFD4MASK5 CFD4MASK5
extern volatile uint32_t   CFD4MASK5 __attribute__((section("sfrs"), address(0xBF885870)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK5bits_t;
extern volatile __CFD4MASK5bits_t CFD4MASK5bits __asm__ ("CFD4MASK5") __attribute__((section("sfrs"), address(0xBF885870)));
extern volatile uint32_t        CFD4MASK5CLR __attribute__((section("sfrs"),address(0xBF885874)));
extern volatile uint32_t        CFD4MASK5SET __attribute__((section("sfrs"),address(0xBF885878)));
extern volatile uint32_t        CFD4MASK5INV __attribute__((section("sfrs"),address(0xBF88587C)));
#define CFD4FLTOBJ6 CFD4FLTOBJ6
extern volatile uint32_t   CFD4FLTOBJ6 __attribute__((section("sfrs"), address(0xBF885880)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ6bits_t;
extern volatile __CFD4FLTOBJ6bits_t CFD4FLTOBJ6bits __asm__ ("CFD4FLTOBJ6") __attribute__((section("sfrs"), address(0xBF885880)));
extern volatile uint32_t        CFD4FLTOBJ6CLR __attribute__((section("sfrs"),address(0xBF885884)));
extern volatile uint32_t        CFD4FLTOBJ6SET __attribute__((section("sfrs"),address(0xBF885888)));
extern volatile uint32_t        CFD4FLTOBJ6INV __attribute__((section("sfrs"),address(0xBF88588C)));
#define CFD4MASK6 CFD4MASK6
extern volatile uint32_t   CFD4MASK6 __attribute__((section("sfrs"), address(0xBF885890)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK6bits_t;
extern volatile __CFD4MASK6bits_t CFD4MASK6bits __asm__ ("CFD4MASK6") __attribute__((section("sfrs"), address(0xBF885890)));
extern volatile uint32_t        CFD4MASK6CLR __attribute__((section("sfrs"),address(0xBF885894)));
extern volatile uint32_t        CFD4MASK6SET __attribute__((section("sfrs"),address(0xBF885898)));
extern volatile uint32_t        CFD4MASK6INV __attribute__((section("sfrs"),address(0xBF88589C)));
#define CFD4FLTOBJ7 CFD4FLTOBJ7
extern volatile uint32_t   CFD4FLTOBJ7 __attribute__((section("sfrs"), address(0xBF8858A0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ7bits_t;
extern volatile __CFD4FLTOBJ7bits_t CFD4FLTOBJ7bits __asm__ ("CFD4FLTOBJ7") __attribute__((section("sfrs"), address(0xBF8858A0)));
extern volatile uint32_t        CFD4FLTOBJ7CLR __attribute__((section("sfrs"),address(0xBF8858A4)));
extern volatile uint32_t        CFD4FLTOBJ7SET __attribute__((section("sfrs"),address(0xBF8858A8)));
extern volatile uint32_t        CFD4FLTOBJ7INV __attribute__((section("sfrs"),address(0xBF8858AC)));
#define CFD4MASK7 CFD4MASK7
extern volatile uint32_t   CFD4MASK7 __attribute__((section("sfrs"), address(0xBF8858B0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK7bits_t;
extern volatile __CFD4MASK7bits_t CFD4MASK7bits __asm__ ("CFD4MASK7") __attribute__((section("sfrs"), address(0xBF8858B0)));
extern volatile uint32_t        CFD4MASK7CLR __attribute__((section("sfrs"),address(0xBF8858B4)));
extern volatile uint32_t        CFD4MASK7SET __attribute__((section("sfrs"),address(0xBF8858B8)));
#define CFD4FLTOBJ8 CFD4FLTOBJ8
extern volatile uint32_t   CFD4FLTOBJ8 __attribute__((section("sfrs"), address(0xBF8858C0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ8bits_t;
