Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpl064.h
extern volatile __CFD4MASK12bits_t CFD4MASK12bits __asm__ ("CFD4MASK12") __attribute__((section("sfrs"), address(0xBF885950)));
extern volatile uint32_t        CFD4MASK12CLR __attribute__((section("sfrs"),address(0xBF885954)));
extern volatile uint32_t        CFD4MASK12SET __attribute__((section("sfrs"),address(0xBF885958)));
extern volatile uint32_t        CFD4MASK12INV __attribute__((section("sfrs"),address(0xBF88595C)));
#define CFD4FLTOBJ13 CFD4FLTOBJ13
extern volatile uint32_t   CFD4FLTOBJ13 __attribute__((section("sfrs"), address(0xBF885960)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ13bits_t;
extern volatile __CFD4FLTOBJ13bits_t CFD4FLTOBJ13bits __asm__ ("CFD4FLTOBJ13") __attribute__((section("sfrs"), address(0xBF885960)));
extern volatile uint32_t        CFD4FLTOBJ13CLR __attribute__((section("sfrs"),address(0xBF885964)));
extern volatile uint32_t        CFD4FLTOBJ13SET __attribute__((section("sfrs"),address(0xBF885968)));
extern volatile uint32_t        CFD4FLTOBJ13INV __attribute__((section("sfrs"),address(0xBF88596C)));
#define CFD4MASK13 CFD4MASK13
extern volatile uint32_t   CFD4MASK13 __attribute__((section("sfrs"), address(0xBF885970)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK13bits_t;
extern volatile __CFD4MASK13bits_t CFD4MASK13bits __asm__ ("CFD4MASK13") __attribute__((section("sfrs"), address(0xBF885970)));
extern volatile uint32_t        CFD4MASK13CLR __attribute__((section("sfrs"),address(0xBF885974)));
extern volatile uint32_t        CFD4MASK13SET __attribute__((section("sfrs"),address(0xBF885978)));
extern volatile uint32_t        CFD4MASK13INV __attribute__((section("sfrs"),address(0xBF88597C)));
#define CFD4FLTOBJ14 CFD4FLTOBJ14
extern volatile uint32_t   CFD4FLTOBJ14 __attribute__((section("sfrs"), address(0xBF885980)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ14bits_t;
extern volatile __CFD4FLTOBJ14bits_t CFD4FLTOBJ14bits __asm__ ("CFD4FLTOBJ14") __attribute__((section("sfrs"), address(0xBF885980)));
extern volatile uint32_t        CFD4FLTOBJ14CLR __attribute__((section("sfrs"),address(0xBF885984)));
extern volatile uint32_t        CFD4FLTOBJ14SET __attribute__((section("sfrs"),address(0xBF885988)));
extern volatile uint32_t        CFD4FLTOBJ14INV __attribute__((section("sfrs"),address(0xBF88598C)));
#define CFD4MASK14 CFD4MASK14
extern volatile uint32_t   CFD4MASK14 __attribute__((section("sfrs"), address(0xBF885990)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK14bits_t;
extern volatile __CFD4MASK14bits_t CFD4MASK14bits __asm__ ("CFD4MASK14") __attribute__((section("sfrs"), address(0xBF885990)));
extern volatile uint32_t        CFD4MASK14CLR __attribute__((section("sfrs"),address(0xBF885994)));
extern volatile uint32_t        CFD4MASK14SET __attribute__((section("sfrs"),address(0xBF885998)));
extern volatile uint32_t        CFD4MASK14INV __attribute__((section("sfrs"),address(0xBF88599C)));
#define CFD4FLTOBJ15 CFD4FLTOBJ15
extern volatile uint32_t   CFD4FLTOBJ15 __attribute__((section("sfrs"), address(0xBF8859A0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ15bits_t;
extern volatile __CFD4FLTOBJ15bits_t CFD4FLTOBJ15bits __asm__ ("CFD4FLTOBJ15") __attribute__((section("sfrs"), address(0xBF8859A0)));
extern volatile uint32_t        CFD4FLTOBJ15CLR __attribute__((section("sfrs"),address(0xBF8859A4)));
extern volatile uint32_t        CFD4FLTOBJ15SET __attribute__((section("sfrs"),address(0xBF8859A8)));
extern volatile uint32_t        CFD4FLTOBJ15INV __attribute__((section("sfrs"),address(0xBF8859AC)));
#define CFD4MASK15 CFD4MASK15
extern volatile uint32_t   CFD4MASK15 __attribute__((section("sfrs"), address(0xBF8859B0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK15bits_t;
extern volatile __CFD4MASK15bits_t CFD4MASK15bits __asm__ ("CFD4MASK15") __attribute__((section("sfrs"), address(0xBF8859B0)));
extern volatile uint32_t        CFD4MASK15CLR __attribute__((section("sfrs"),address(0xBF8859B4)));
extern volatile uint32_t        CFD4MASK15SET __attribute__((section("sfrs"),address(0xBF8859B8)));
extern volatile uint32_t        CFD4MASK15INV __attribute__((section("sfrs"),address(0xBF8859BC)));
#define CFD4FLTOBJ16 CFD4FLTOBJ16
extern volatile uint32_t   CFD4FLTOBJ16 __attribute__((section("sfrs"), address(0xBF8859C0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ16bits_t;
extern volatile __CFD4FLTOBJ16bits_t CFD4FLTOBJ16bits __asm__ ("CFD4FLTOBJ16") __attribute__((section("sfrs"), address(0xBF8859C0)));
extern volatile uint32_t        CFD4FLTOBJ16CLR __attribute__((section("sfrs"),address(0xBF8859C4)));
extern volatile uint32_t        CFD4FLTOBJ16SET __attribute__((section("sfrs"),address(0xBF8859C8)));
extern volatile uint32_t        CFD4FLTOBJ16INV __attribute__((section("sfrs"),address(0xBF8859CC)));
#define CFD4MASK16 CFD4MASK16
extern volatile uint32_t   CFD4MASK16 __attribute__((section("sfrs"), address(0xBF8859D0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK16bits_t;
extern volatile __CFD4MASK16bits_t CFD4MASK16bits __asm__ ("CFD4MASK16") __attribute__((section("sfrs"), address(0xBF8859D0)));
extern volatile uint32_t        CFD4MASK16CLR __attribute__((section("sfrs"),address(0xBF8859D4)));
extern volatile uint32_t        CFD4MASK16SET __attribute__((section("sfrs"),address(0xBF8859D8)));
extern volatile uint32_t        CFD4MASK16INV __attribute__((section("sfrs"),address(0xBF8859DC)));
#define CFD4FLTOBJ17 CFD4FLTOBJ17
extern volatile uint32_t   CFD4FLTOBJ17 __attribute__((section("sfrs"), address(0xBF8859E0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ17bits_t;
extern volatile __CFD4FLTOBJ17bits_t CFD4FLTOBJ17bits __asm__ ("CFD4FLTOBJ17") __attribute__((section("sfrs"), address(0xBF8859E0)));
extern volatile uint32_t        CFD4FLTOBJ17CLR __attribute__((section("sfrs"),address(0xBF8859E4)));
extern volatile uint32_t        CFD4FLTOBJ17SET __attribute__((section("sfrs"),address(0xBF8859E8)));
extern volatile uint32_t        CFD4FLTOBJ17INV __attribute__((section("sfrs"),address(0xBF8859EC)));
#define CFD4MASK17 CFD4MASK17
extern volatile uint32_t   CFD4MASK17 __attribute__((section("sfrs"), address(0xBF8859F0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK17bits_t;
extern volatile __CFD4MASK17bits_t CFD4MASK17bits __asm__ ("CFD4MASK17") __attribute__((section("sfrs"), address(0xBF8859F0)));
extern volatile uint32_t        CFD4MASK17CLR __attribute__((section("sfrs"),address(0xBF8859F4)));
extern volatile uint32_t        CFD4MASK17SET __attribute__((section("sfrs"),address(0xBF8859F8)));
extern volatile uint32_t        CFD4MASK17INV __attribute__((section("sfrs"),address(0xBF8859FC)));
#define CFD4FLTOBJ18 CFD4FLTOBJ18
extern volatile uint32_t   CFD4FLTOBJ18 __attribute__((section("sfrs"), address(0xBF885A00)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ18bits_t;
extern volatile __CFD4FLTOBJ18bits_t CFD4FLTOBJ18bits __asm__ ("CFD4FLTOBJ18") __attribute__((section("sfrs"), address(0xBF885A00)));
extern volatile uint32_t        CFD4FLTOBJ18CLR __attribute__((section("sfrs"),address(0xBF885A04)));
extern volatile uint32_t        CFD4FLTOBJ18SET __attribute__((section("sfrs"),address(0xBF885A08)));
extern volatile uint32_t        CFD4FLTOBJ18INV __attribute__((section("sfrs"),address(0xBF885A0C)));
#define CFD4MASK18 CFD4MASK18
extern volatile uint32_t   CFD4MASK18 __attribute__((section("sfrs"), address(0xBF885A10)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK18bits_t;
extern volatile __CFD4MASK18bits_t CFD4MASK18bits __asm__ ("CFD4MASK18") __attribute__((section("sfrs"), address(0xBF885A10)));
extern volatile uint32_t        CFD4MASK18CLR __attribute__((section("sfrs"),address(0xBF885A14)));
extern volatile uint32_t        CFD4MASK18SET __attribute__((section("sfrs"),address(0xBF885A18)));
extern volatile uint32_t        CFD4MASK18INV __attribute__((section("sfrs"),address(0xBF885A1C)));
#define CFD4FLTOBJ19 CFD4FLTOBJ19
extern volatile uint32_t   CFD4FLTOBJ19 __attribute__((section("sfrs"), address(0xBF885A20)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ19bits_t;
extern volatile __CFD4FLTOBJ19bits_t CFD4FLTOBJ19bits __asm__ ("CFD4FLTOBJ19") __attribute__((section("sfrs"), address(0xBF885A20)));
extern volatile uint32_t        CFD4FLTOBJ19CLR __attribute__((section("sfrs"),address(0xBF885A24)));
extern volatile uint32_t        CFD4FLTOBJ19SET __attribute__((section("sfrs"),address(0xBF885A28)));
extern volatile uint32_t        CFD4FLTOBJ19INV __attribute__((section("sfrs"),address(0xBF885A2C)));
#define CFD4MASK19 CFD4MASK19
extern volatile uint32_t   CFD4MASK19 __attribute__((section("sfrs"), address(0xBF885A30)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK19bits_t;
