Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpl064.h
extern volatile __CFD4MASK19bits_t CFD4MASK19bits __asm__ ("CFD4MASK19") __attribute__((section("sfrs"), address(0xBF885A30)));
extern volatile uint32_t        CFD4MASK19CLR __attribute__((section("sfrs"),address(0xBF885A34)));
extern volatile uint32_t        CFD4MASK19SET __attribute__((section("sfrs"),address(0xBF885A38)));
extern volatile uint32_t        CFD4MASK19INV __attribute__((section("sfrs"),address(0xBF885A3C)));
#define CFD4FLTOBJ20 CFD4FLTOBJ20
extern volatile uint32_t   CFD4FLTOBJ20 __attribute__((section("sfrs"), address(0xBF885A40)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ20bits_t;
extern volatile __CFD4FLTOBJ20bits_t CFD4FLTOBJ20bits __asm__ ("CFD4FLTOBJ20") __attribute__((section("sfrs"), address(0xBF885A40)));
extern volatile uint32_t        CFD4FLTOBJ20CLR __attribute__((section("sfrs"),address(0xBF885A44)));
extern volatile uint32_t        CFD4FLTOBJ20SET __attribute__((section("sfrs"),address(0xBF885A48)));
extern volatile uint32_t        CFD4FLTOBJ20INV __attribute__((section("sfrs"),address(0xBF885A4C)));
#define CFD4MASK20 CFD4MASK20
extern volatile uint32_t   CFD4MASK20 __attribute__((section("sfrs"), address(0xBF885A50)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK20bits_t;
extern volatile __CFD4MASK20bits_t CFD4MASK20bits __asm__ ("CFD4MASK20") __attribute__((section("sfrs"), address(0xBF885A50)));
extern volatile uint32_t        CFD4MASK20CLR __attribute__((section("sfrs"),address(0xBF885A54)));
extern volatile uint32_t        CFD4MASK20SET __attribute__((section("sfrs"),address(0xBF885A58)));
extern volatile uint32_t        CFD4MASK20INV __attribute__((section("sfrs"),address(0xBF885A5C)));
#define CFD4FLTOBJ21 CFD4FLTOBJ21
extern volatile uint32_t   CFD4FLTOBJ21 __attribute__((section("sfrs"), address(0xBF885A60)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ21bits_t;
extern volatile __CFD4FLTOBJ21bits_t CFD4FLTOBJ21bits __asm__ ("CFD4FLTOBJ21") __attribute__((section("sfrs"), address(0xBF885A60)));
extern volatile uint32_t        CFD4FLTOBJ21CLR __attribute__((section("sfrs"),address(0xBF885A64)));
extern volatile uint32_t        CFD4FLTOBJ21SET __attribute__((section("sfrs"),address(0xBF885A68)));
extern volatile uint32_t        CFD4FLTOBJ21INV __attribute__((section("sfrs"),address(0xBF885A6C)));
#define CFD4MASK21 CFD4MASK21
extern volatile uint32_t   CFD4MASK21 __attribute__((section("sfrs"), address(0xBF885A70)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK21bits_t;
extern volatile __CFD4MASK21bits_t CFD4MASK21bits __asm__ ("CFD4MASK21") __attribute__((section("sfrs"), address(0xBF885A70)));
extern volatile uint32_t        CFD4MASK21CLR __attribute__((section("sfrs"),address(0xBF885A74)));
extern volatile uint32_t        CFD4MASK21SET __attribute__((section("sfrs"),address(0xBF885A78)));
extern volatile uint32_t        CFD4MASK21INV __attribute__((section("sfrs"),address(0xBF885A7C)));
#define CFD4FLTOBJ22 CFD4FLTOBJ22
extern volatile uint32_t   CFD4FLTOBJ22 __attribute__((section("sfrs"), address(0xBF885A80)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ22bits_t;
extern volatile __CFD4FLTOBJ22bits_t CFD4FLTOBJ22bits __asm__ ("CFD4FLTOBJ22") __attribute__((section("sfrs"), address(0xBF885A80)));
extern volatile uint32_t        CFD4FLTOBJ22CLR __attribute__((section("sfrs"),address(0xBF885A84)));
extern volatile uint32_t        CFD4FLTOBJ22SET __attribute__((section("sfrs"),address(0xBF885A88)));
extern volatile uint32_t        CFD4FLTOBJ22INV __attribute__((section("sfrs"),address(0xBF885A8C)));
#define CFD4MASK22 CFD4MASK22
extern volatile uint32_t   CFD4MASK22 __attribute__((section("sfrs"), address(0xBF885A90)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK22bits_t;
extern volatile __CFD4MASK22bits_t CFD4MASK22bits __asm__ ("CFD4MASK22") __attribute__((section("sfrs"), address(0xBF885A90)));
extern volatile uint32_t        CFD4MASK22CLR __attribute__((section("sfrs"),address(0xBF885A94)));
extern volatile uint32_t        CFD4MASK22SET __attribute__((section("sfrs"),address(0xBF885A98)));
extern volatile uint32_t        CFD4MASK22INV __attribute__((section("sfrs"),address(0xBF885A9C)));
#define CFD4FLTOBJ23 CFD4FLTOBJ23
extern volatile uint32_t   CFD4FLTOBJ23 __attribute__((section("sfrs"), address(0xBF885AA0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ23bits_t;
extern volatile __CFD4FLTOBJ23bits_t CFD4FLTOBJ23bits __asm__ ("CFD4FLTOBJ23") __attribute__((section("sfrs"), address(0xBF885AA0)));
extern volatile uint32_t        CFD4FLTOBJ23CLR __attribute__((section("sfrs"),address(0xBF885AA4)));
extern volatile uint32_t        CFD4FLTOBJ23SET __attribute__((section("sfrs"),address(0xBF885AA8)));
extern volatile uint32_t        CFD4FLTOBJ23INV __attribute__((section("sfrs"),address(0xBF885AAC)));
#define CFD4MASK23 CFD4MASK23
extern volatile uint32_t   CFD4MASK23 __attribute__((section("sfrs"), address(0xBF885AB0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK23bits_t;
extern volatile __CFD4MASK23bits_t CFD4MASK23bits __asm__ ("CFD4MASK23") __attribute__((section("sfrs"), address(0xBF885AB0)));
extern volatile uint32_t        CFD4MASK23CLR __attribute__((section("sfrs"),address(0xBF885AB4)));
extern volatile uint32_t        CFD4MASK23SET __attribute__((section("sfrs"),address(0xBF885AB8)));
extern volatile uint32_t        CFD4MASK23INV __attribute__((section("sfrs"),address(0xBF885ABC)));
#define CFD4FLTOBJ24 CFD4FLTOBJ24
extern volatile uint32_t   CFD4FLTOBJ24 __attribute__((section("sfrs"), address(0xBF885AC0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ24bits_t;
extern volatile __CFD4FLTOBJ24bits_t CFD4FLTOBJ24bits __asm__ ("CFD4FLTOBJ24") __attribute__((section("sfrs"), address(0xBF885AC0)));
extern volatile uint32_t        CFD4FLTOBJ24CLR __attribute__((section("sfrs"),address(0xBF885AC4)));
extern volatile uint32_t        CFD4FLTOBJ24SET __attribute__((section("sfrs"),address(0xBF885AC8)));
extern volatile uint32_t        CFD4FLTOBJ24INV __attribute__((section("sfrs"),address(0xBF885ACC)));
#define CFD4MASK24 CFD4MASK24
extern volatile uint32_t   CFD4MASK24 __attribute__((section("sfrs"), address(0xBF885AD0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK24bits_t;
extern volatile __CFD4MASK24bits_t CFD4MASK24bits __asm__ ("CFD4MASK24") __attribute__((section("sfrs"), address(0xBF885AD0)));
extern volatile uint32_t        CFD4MASK24CLR __attribute__((section("sfrs"),address(0xBF885AD4)));
extern volatile uint32_t        CFD4MASK24SET __attribute__((section("sfrs"),address(0xBF885AD8)));
extern volatile uint32_t        CFD4MASK24INV __attribute__((section("sfrs"),address(0xBF885ADC)));
#define CFD4FLTOBJ25 CFD4FLTOBJ25
extern volatile uint32_t   CFD4FLTOBJ25 __attribute__((section("sfrs"), address(0xBF885AE0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ25bits_t;
extern volatile __CFD4FLTOBJ25bits_t CFD4FLTOBJ25bits __asm__ ("CFD4FLTOBJ25") __attribute__((section("sfrs"), address(0xBF885AE0)));
extern volatile uint32_t        CFD4FLTOBJ25CLR __attribute__((section("sfrs"),address(0xBF885AE4)));
extern volatile uint32_t        CFD4FLTOBJ25SET __attribute__((section("sfrs"),address(0xBF885AE8)));
extern volatile uint32_t        CFD4FLTOBJ25INV __attribute__((section("sfrs"),address(0xBF885AEC)));
#define CFD4MASK25 CFD4MASK25
extern volatile uint32_t   CFD4MASK25 __attribute__((section("sfrs"), address(0xBF885AF0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK25bits_t;
extern volatile __CFD4MASK25bits_t CFD4MASK25bits __asm__ ("CFD4MASK25") __attribute__((section("sfrs"), address(0xBF885AF0)));
extern volatile uint32_t        CFD4MASK25CLR __attribute__((section("sfrs"),address(0xBF885AF4)));
extern volatile uint32_t        CFD4MASK25SET __attribute__((section("sfrs"),address(0xBF885AF8)));
extern volatile uint32_t        CFD4MASK25INV __attribute__((section("sfrs"),address(0xBF885AFC)));
#define CFD4FLTOBJ26 CFD4FLTOBJ26
extern volatile uint32_t   CFD4FLTOBJ26 __attribute__((section("sfrs"), address(0xBF885B00)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ26bits_t;
extern volatile __CFD4FLTOBJ26bits_t CFD4FLTOBJ26bits __asm__ ("CFD4FLTOBJ26") __attribute__((section("sfrs"), address(0xBF885B00)));
extern volatile uint32_t        CFD4FLTOBJ26CLR __attribute__((section("sfrs"),address(0xBF885B04)));
extern volatile uint32_t        CFD4FLTOBJ26SET __attribute__((section("sfrs"),address(0xBF885B08)));
extern volatile uint32_t        CFD4FLTOBJ26INV __attribute__((section("sfrs"),address(0xBF885B0C)));
#define CFD4MASK26 CFD4MASK26
extern volatile uint32_t   CFD4MASK26 __attribute__((section("sfrs"), address(0xBF885B10)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK26bits_t;
extern volatile __CFD4MASK26bits_t CFD4MASK26bits __asm__ ("CFD4MASK26") __attribute__((section("sfrs"), address(0xBF885B10)));
extern volatile uint32_t        CFD4MASK26CLR __attribute__((section("sfrs"),address(0xBF885B14)));
extern volatile uint32_t        CFD4MASK26SET __attribute__((section("sfrs"),address(0xBF885B18)));
extern volatile uint32_t        CFD4MASK26INV __attribute__((section("sfrs"),address(0xBF885B1C)));
#define CFD4FLTOBJ27 CFD4FLTOBJ27
extern volatile uint32_t   CFD4FLTOBJ27 __attribute__((section("sfrs"), address(0xBF885B20)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ27bits_t;
extern volatile __CFD4FLTOBJ27bits_t CFD4FLTOBJ27bits __asm__ ("CFD4FLTOBJ27") __attribute__((section("sfrs"), address(0xBF885B20)));
extern volatile uint32_t        CFD4FLTOBJ27CLR __attribute__((section("sfrs"),address(0xBF885B24)));
extern volatile uint32_t        CFD4FLTOBJ27SET __attribute__((section("sfrs"),address(0xBF885B28)));
extern volatile uint32_t        CFD4FLTOBJ27INV __attribute__((section("sfrs"),address(0xBF885B2C)));
#define CFD4MASK27 CFD4MASK27
extern volatile uint32_t   CFD4MASK27 __attribute__((section("sfrs"), address(0xBF885B30)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK27bits_t;
extern volatile __CFD4MASK27bits_t CFD4MASK27bits __asm__ ("CFD4MASK27") __attribute__((section("sfrs"), address(0xBF885B30)));
extern volatile uint32_t        CFD4MASK27CLR __attribute__((section("sfrs"),address(0xBF885B34)));
extern volatile uint32_t        CFD4MASK27SET __attribute__((section("sfrs"),address(0xBF885B38)));
extern volatile uint32_t        CFD4MASK27INV __attribute__((section("sfrs"),address(0xBF885B3C)));
#define CFD4FLTOBJ28 CFD4FLTOBJ28
extern volatile uint32_t   CFD4FLTOBJ28 __attribute__((section("sfrs"), address(0xBF885B40)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ28bits_t;
extern volatile __CFD4FLTOBJ28bits_t CFD4FLTOBJ28bits __asm__ ("CFD4FLTOBJ28") __attribute__((section("sfrs"), address(0xBF885B40)));
extern volatile uint32_t        CFD4FLTOBJ28CLR __attribute__((section("sfrs"),address(0xBF885B44)));
extern volatile uint32_t        CFD4FLTOBJ28SET __attribute__((section("sfrs"),address(0xBF885B48)));
extern volatile uint32_t        CFD4FLTOBJ28INV __attribute__((section("sfrs"),address(0xBF885B4C)));
#define CFD4MASK28 CFD4MASK28
extern volatile uint32_t   CFD4MASK28 __attribute__((section("sfrs"), address(0xBF885B50)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK28bits_t;
extern volatile __CFD4MASK28bits_t CFD4MASK28bits __asm__ ("CFD4MASK28") __attribute__((section("sfrs"), address(0xBF885B50)));
extern volatile uint32_t        CFD4MASK28CLR __attribute__((section("sfrs"),address(0xBF885B54)));
extern volatile uint32_t        CFD4MASK28SET __attribute__((section("sfrs"),address(0xBF885B58)));
extern volatile uint32_t        CFD4MASK28INV __attribute__((section("sfrs"),address(0xBF885B5C)));
#define CFD4FLTOBJ29 CFD4FLTOBJ29
extern volatile uint32_t   CFD4FLTOBJ29 __attribute__((section("sfrs"), address(0xBF885B60)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ29bits_t;
extern volatile __CFD4FLTOBJ29bits_t CFD4FLTOBJ29bits __asm__ ("CFD4FLTOBJ29") __attribute__((section("sfrs"), address(0xBF885B60)));
extern volatile uint32_t        CFD4FLTOBJ29CLR __attribute__((section("sfrs"),address(0xBF885B64)));
extern volatile uint32_t        CFD4FLTOBJ29SET __attribute__((section("sfrs"),address(0xBF885B68)));
extern volatile uint32_t        CFD4FLTOBJ29INV __attribute__((section("sfrs"),address(0xBF885B6C)));
#define CFD4MASK29 CFD4MASK29
extern volatile uint32_t   CFD4MASK29 __attribute__((section("sfrs"), address(0xBF885B70)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK29bits_t;
extern volatile __CFD4MASK29bits_t CFD4MASK29bits __asm__ ("CFD4MASK29") __attribute__((section("sfrs"), address(0xBF885B70)));
extern volatile uint32_t        CFD4MASK29CLR __attribute__((section("sfrs"),address(0xBF885B74)));
extern volatile uint32_t        CFD4MASK29SET __attribute__((section("sfrs"),address(0xBF885B78)));
extern volatile uint32_t        CFD4MASK29INV __attribute__((section("sfrs"),address(0xBF885B7C)));
#define CFD4FLTOBJ30 CFD4FLTOBJ30
extern volatile uint32_t   CFD4FLTOBJ30 __attribute__((section("sfrs"), address(0xBF885B80)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ30bits_t;
extern volatile __CFD4FLTOBJ30bits_t CFD4FLTOBJ30bits __asm__ ("CFD4FLTOBJ30") __attribute__((section("sfrs"), address(0xBF885B80)));
extern volatile uint32_t        CFD4FLTOBJ30CLR __attribute__((section("sfrs"),address(0xBF885B84)));
extern volatile uint32_t        CFD4FLTOBJ30SET __attribute__((section("sfrs"),address(0xBF885B88)));
extern volatile uint32_t        CFD4FLTOBJ30INV __attribute__((section("sfrs"),address(0xBF885B8C)));
#define CFD4MASK30 CFD4MASK30
extern volatile uint32_t   CFD4MASK30 __attribute__((section("sfrs"), address(0xBF885B90)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK30bits_t;
extern volatile __CFD4MASK30bits_t CFD4MASK30bits __asm__ ("CFD4MASK30") __attribute__((section("sfrs"), address(0xBF885B90)));
extern volatile uint32_t        CFD4MASK30CLR __attribute__((section("sfrs"),address(0xBF885B94)));
extern volatile uint32_t        CFD4MASK30SET __attribute__((section("sfrs"),address(0xBF885B98)));
extern volatile uint32_t        CFD4MASK30INV __attribute__((section("sfrs"),address(0xBF885B9C)));
#define CFD4FLTOBJ31 CFD4FLTOBJ31
extern volatile uint32_t   CFD4FLTOBJ31 __attribute__((section("sfrs"), address(0xBF885BA0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ31bits_t;
extern volatile __CFD4FLTOBJ31bits_t CFD4FLTOBJ31bits __asm__ ("CFD4FLTOBJ31") __attribute__((section("sfrs"), address(0xBF885BA0)));
extern volatile uint32_t        CFD4FLTOBJ31CLR __attribute__((section("sfrs"),address(0xBF885BA4)));
extern volatile uint32_t        CFD4FLTOBJ31SET __attribute__((section("sfrs"),address(0xBF885BA8)));
extern volatile uint32_t        CFD4FLTOBJ31INV __attribute__((section("sfrs"),address(0xBF885BAC)));
#define CFD4MASK31 CFD4MASK31
extern volatile uint32_t   CFD4MASK31 __attribute__((section("sfrs"), address(0xBF885BB0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK31bits_t;
extern volatile __CFD4MASK31bits_t CFD4MASK31bits __asm__ ("CFD4MASK31") __attribute__((section("sfrs"), address(0xBF885BB0)));
extern volatile uint32_t        CFD4MASK31CLR __attribute__((section("sfrs"),address(0xBF885BB4)));
extern volatile uint32_t        CFD4MASK31SET __attribute__((section("sfrs"),address(0xBF885BB8)));
extern volatile uint32_t        CFD4MASK31INV __attribute__((section("sfrs"),address(0xBF885BBC)));
#define ADCCON1 ADCCON1
extern volatile uint32_t   ADCCON1 __attribute__((section("sfrs"), address(0xBF887000)));
typedef struct {
  uint32_t DMABL:3;
  uint32_t STRGLVL:1;
  uint32_t IRQVS:3;
  uint32_t :2;
  uint32_t FSPBCLKEN:1;
  uint32_t FSSCLKEN:1;
  uint32_t CVDEN:1;
  uint32_t AICPMPEN:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t STRGSRC:5;
  uint32_t SELRES:2;
  uint32_t FRACT:1;
  uint32_t TRBSLV:3;
  uint32_t TRBMST:3;
  uint32_t TRBERR:1;
  uint32_t TRBEN:1;
} __ADCCON1bits_t;
extern volatile __ADCCON1bits_t ADCCON1bits __asm__ ("ADCCON1") __attribute__((section("sfrs"), address(0xBF887000)));
extern volatile uint32_t        ADCCON1CLR __attribute__((section("sfrs"),address(0xBF887004)));
extern volatile uint32_t        ADCCON1SET __attribute__((section("sfrs"),address(0xBF887008)));
extern volatile uint32_t        ADCCON1INV __attribute__((section("sfrs"),address(0xBF88700C)));
#define ADCCON2 ADCCON2
extern volatile uint32_t   ADCCON2 __attribute__((section("sfrs"), address(0xBF887010)));
typedef struct {
  uint32_t ADCDIV:7;
  uint32_t :1;
  uint32_t ADCEIS:3;
  uint32_t :1;
  uint32_t ADCEIOVR:1;
  uint32_t EOSIEN:1;
  uint32_t REFFLTIEN:1;
  uint32_t BGVRIEN:1;
  uint32_t SAMC:10;
  uint32_t CVDCPL:3;
  uint32_t EOSRDY:1;
  uint32_t REFFLT:1;
  uint32_t BGVRRDY:1;
} __ADCCON2bits_t;
extern volatile __ADCCON2bits_t ADCCON2bits __asm__ ("ADCCON2") __attribute__((section("sfrs"), address(0xBF887010)));
extern volatile uint32_t        ADCCON2CLR __attribute__((section("sfrs"),address(0xBF887014)));
extern volatile uint32_t        ADCCON2SET __attribute__((section("sfrs"),address(0xBF887018)));
extern volatile uint32_t        ADCCON2INV __attribute__((section("sfrs"),address(0xBF88701C)));
#define ADCCON3 ADCCON3
extern volatile uint32_t   ADCCON3 __attribute__((section("sfrs"), address(0xBF887020)));
typedef struct {
  uint32_t ADINSEL:6;
  uint32_t GSWTRG:1;
  uint32_t GLSWTRG:1;
  uint32_t RQCNVRT:1;
  uint32_t SAMP:1;
  uint32_t UPDRDY:1;
  uint32_t UPDIEN:1;
  uint32_t TRGSUSP:1;
  uint32_t VREFSEL:3;
  uint32_t DIGEN0:1;
  uint32_t DIGEN1:1;
  uint32_t DIGEN2:1;
  uint32_t DIGEN3:1;
  uint32_t DIGEN4:1;
  uint32_t DIGEN5:1;
  uint32_t :1;
  uint32_t DIGEN7:1;
  uint32_t CONCLKDIV:6;
  uint32_t ADCSEL:2;
} __ADCCON3bits_t;
extern volatile __ADCCON3bits_t ADCCON3bits __asm__ ("ADCCON3") __attribute__((section("sfrs"), address(0xBF887020)));
extern volatile uint32_t        ADCCON3CLR __attribute__((section("sfrs"),address(0xBF887024)));
extern volatile uint32_t        ADCCON3SET __attribute__((section("sfrs"),address(0xBF887028)));
extern volatile uint32_t        ADCCON3INV __attribute__((section("sfrs"),address(0xBF88702C)));
#define ADCTRGMODE ADCTRGMODE
extern volatile uint32_t   ADCTRGMODE __attribute__((section("sfrs"), address(0xBF887030)));
typedef struct {
  uint32_t SSAMPEN0:1;
  uint32_t SSAMPEN1:1;
  uint32_t SSAMPEN2:1;
  uint32_t SSAMPEN3:1;
  uint32_t SSAMPEN4:1;
  uint32_t SSAMPEN5:1;
  uint32_t :2;
  uint32_t STRGEN0:1;
  uint32_t STRGEN1:1;
  uint32_t STRGEN2:1;
  uint32_t STRGEN3:1;
  uint32_t STRGEN4:1;
  uint32_t STRGEN5:1;
  uint32_t :2;
  uint32_t SH0ALT:2;
  uint32_t SH1ALT:2;
  uint32_t SH2ALT:2;
  uint32_t SH3ALT:2;
  uint32_t SH4ALT:2;
  uint32_t SH5ALT:2;
} __ADCTRGMODEbits_t;
extern volatile __ADCTRGMODEbits_t ADCTRGMODEbits __asm__ ("ADCTRGMODE") __attribute__((section("sfrs"), address(0xBF887030)));
extern volatile uint32_t        ADCTRGMODECLR __attribute__((section("sfrs"),address(0xBF887034)));
extern volatile uint32_t        ADCTRGMODESET __attribute__((section("sfrs"),address(0xBF887038)));
extern volatile uint32_t        ADCTRGMODEINV __attribute__((section("sfrs"),address(0xBF88703C)));
#define ADCIMCON1 ADCIMCON1
extern volatile uint32_t   ADCIMCON1 __attribute__((section("sfrs"), address(0xBF887040)));
typedef struct {
  uint32_t SIGN0:1;
  uint32_t DIFF0:1;
  uint32_t SIGN1:1;
  uint32_t DIFF1:1;
  uint32_t SIGN2:1;
  uint32_t DIFF2:1;
  uint32_t SIGN3:1;
  uint32_t DIFF3:1;
  uint32_t SIGN4:1;
  uint32_t DIFF4:1;
  uint32_t SIGN5:1;
  uint32_t DIFF5:1;
  uint32_t SIGN6:1;
  uint32_t DIFF6:1;
  uint32_t SIGN7:1;
  uint32_t DIFF7:1;
  uint32_t SIGN8:1;
  uint32_t DIFF8:1;
  uint32_t SIGN9:1;
  uint32_t DIFF9:1;
  uint32_t SIGN10:1;
  uint32_t DIFF10:1;
  uint32_t SIGN11:1;
  uint32_t DIFF11:1;
  uint32_t SIGN12:1;
  uint32_t DIFF12:1;
  uint32_t SIGN13:1;
  uint32_t DIFF13:1;
  uint32_t SIGN14:1;
  uint32_t DIFF14:1;
  uint32_t SIGN15:1;
  uint32_t DIFF15:1;
} __ADCIMCON1bits_t;
