Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpl064.h
#define _CFD2TEFCON_TEFHIE_POSITION              0x00000001
#define _CFD2TEFCON_TEFHIE_MASK                  0x00000002
#define _CFD2TEFCON_TEFHIE_LENGTH                0x00000001

#define _CFD2TEFCON_TEFFIE_POSITION              0x00000002
#define _CFD2TEFCON_TEFFIE_MASK                  0x00000004
#define _CFD2TEFCON_TEFFIE_LENGTH                0x00000001

#define _CFD2TEFCON_TEFOVIE_POSITION             0x00000003
#define _CFD2TEFCON_TEFOVIE_MASK                 0x00000008
#define _CFD2TEFCON_TEFOVIE_LENGTH               0x00000001

#define _CFD2TEFCON_TEFTSEN_POSITION             0x00000005
#define _CFD2TEFCON_TEFTSEN_MASK                 0x00000020
#define _CFD2TEFCON_TEFTSEN_LENGTH               0x00000001

#define _CFD2TEFCON_UINC_POSITION                0x00000008
#define _CFD2TEFCON_UINC_MASK                    0x00000100
#define _CFD2TEFCON_UINC_LENGTH                  0x00000001

#define _CFD2TEFCON_FRESET_POSITION              0x0000000A
#define _CFD2TEFCON_FRESET_MASK                  0x00000400
#define _CFD2TEFCON_FRESET_LENGTH                0x00000001

#define _CFD2TEFCON_FSIZE_POSITION               0x00000018
#define _CFD2TEFCON_FSIZE_MASK                   0x1F000000
#define _CFD2TEFCON_FSIZE_LENGTH                 0x00000005

#define _CFD2TEFSTA_TEFNEIF_POSITION             0x00000000
#define _CFD2TEFSTA_TEFNEIF_MASK                 0x00000001
#define _CFD2TEFSTA_TEFNEIF_LENGTH               0x00000001

#define _CFD2TEFSTA_TEFHIF_POSITION              0x00000001
#define _CFD2TEFSTA_TEFHIF_MASK                  0x00000002
#define _CFD2TEFSTA_TEFHIF_LENGTH                0x00000001

#define _CFD2TEFSTA_TEFFIF_POSITION              0x00000002
#define _CFD2TEFSTA_TEFFIF_MASK                  0x00000004
#define _CFD2TEFSTA_TEFFIF_LENGTH                0x00000001

#define _CFD2TEFSTA_TEFOVIF_POSITION             0x00000003
#define _CFD2TEFSTA_TEFOVIF_MASK                 0x00000008
#define _CFD2TEFSTA_TEFOVIF_LENGTH               0x00000001

#define _CFD2TEFUA_TEFUA_POSITION                0x00000000
#define _CFD2TEFUA_TEFUA_MASK                    0xFFFFFFFF
#define _CFD2TEFUA_TEFUA_LENGTH                  0x00000020

#define _CFD2FIFOBA_FIFOBA_POSITION              0x00000000
#define _CFD2FIFOBA_FIFOBA_MASK                  0xFFFFFFFF
#define _CFD2FIFOBA_FIFOBA_LENGTH                0x00000020

#define _CFD2TXQCON_TXQNIE_POSITION              0x00000000
#define _CFD2TXQCON_TXQNIE_MASK                  0x00000001
#define _CFD2TXQCON_TXQNIE_LENGTH                0x00000001

#define _CFD2TXQCON_TXQEIE_POSITION              0x00000002
#define _CFD2TXQCON_TXQEIE_MASK                  0x00000004
#define _CFD2TXQCON_TXQEIE_LENGTH                0x00000001

#define _CFD2TXQCON_TXATIE_POSITION              0x00000004
#define _CFD2TXQCON_TXATIE_MASK                  0x00000010
#define _CFD2TXQCON_TXATIE_LENGTH                0x00000001

#define _CFD2TXQCON_TXEN_POSITION                0x00000007
#define _CFD2TXQCON_TXEN_MASK                    0x00000080
#define _CFD2TXQCON_TXEN_LENGTH                  0x00000001

#define _CFD2TXQCON_UINC_POSITION                0x00000008
#define _CFD2TXQCON_UINC_MASK                    0x00000100
#define _CFD2TXQCON_UINC_LENGTH                  0x00000001

#define _CFD2TXQCON_TXREQ_POSITION               0x00000009
#define _CFD2TXQCON_TXREQ_MASK                   0x00000200
#define _CFD2TXQCON_TXREQ_LENGTH                 0x00000001

#define _CFD2TXQCON_FRESET_POSITION              0x0000000A
#define _CFD2TXQCON_FRESET_MASK                  0x00000400
#define _CFD2TXQCON_FRESET_LENGTH                0x00000001

#define _CFD2TXQCON_TXPRI_POSITION               0x00000010
#define _CFD2TXQCON_TXPRI_MASK                   0x001F0000
#define _CFD2TXQCON_TXPRI_LENGTH                 0x00000005

#define _CFD2TXQCON_TXAT_POSITION                0x00000015
#define _CFD2TXQCON_TXAT_MASK                    0x00600000
#define _CFD2TXQCON_TXAT_LENGTH                  0x00000002

#define _CFD2TXQCON_FSIZE_POSITION               0x00000018
#define _CFD2TXQCON_FSIZE_MASK                   0x1F000000
#define _CFD2TXQCON_FSIZE_LENGTH                 0x00000005

#define _CFD2TXQCON_PLSIZE_POSITION              0x0000001D
#define _CFD2TXQCON_PLSIZE_MASK                  0xE0000000
#define _CFD2TXQCON_PLSIZE_LENGTH                0x00000003

#define _CFD2TXQSTA_TXQNIF_POSITION              0x00000000
#define _CFD2TXQSTA_TXQNIF_MASK                  0x00000001
#define _CFD2TXQSTA_TXQNIF_LENGTH                0x00000001

#define _CFD2TXQSTA_TXQEIF_POSITION              0x00000002
#define _CFD2TXQSTA_TXQEIF_MASK                  0x00000004
#define _CFD2TXQSTA_TXQEIF_LENGTH                0x00000001

#define _CFD2TXQSTA_TXATIF_POSITION              0x00000004
#define _CFD2TXQSTA_TXATIF_MASK                  0x00000010
#define _CFD2TXQSTA_TXATIF_LENGTH                0x00000001

#define _CFD2TXQSTA_TXERR_POSITION               0x00000005
#define _CFD2TXQSTA_TXERR_MASK                   0x00000020
#define _CFD2TXQSTA_TXERR_LENGTH                 0x00000001

#define _CFD2TXQSTA_TXLARB_POSITION              0x00000006
#define _CFD2TXQSTA_TXLARB_MASK                  0x00000040
#define _CFD2TXQSTA_TXLARB_LENGTH                0x00000001

#define _CFD2TXQSTA_TXABT_POSITION               0x00000007
#define _CFD2TXQSTA_TXABT_MASK                   0x00000080
#define _CFD2TXQSTA_TXABT_LENGTH                 0x00000001

#define _CFD2TXQSTA_TXQCI_POSITION               0x00000008
#define _CFD2TXQSTA_TXQCI_MASK                   0x00001F00
#define _CFD2TXQSTA_TXQCI_LENGTH                 0x00000005

#define _CFD2TXQUA_TXQUA_POSITION                0x00000000
#define _CFD2TXQUA_TXQUA_MASK                    0xFFFFFFFF
#define _CFD2TXQUA_TXQUA_LENGTH                  0x00000020

#define _CFD2FIFOCON1_TFNRFNIE_POSITION          0x00000000
#define _CFD2FIFOCON1_TFNRFNIE_MASK              0x00000001
#define _CFD2FIFOCON1_TFNRFNIE_LENGTH            0x00000001

#define _CFD2FIFOCON1_TFHRFHIE_POSITION          0x00000001
#define _CFD2FIFOCON1_TFHRFHIE_MASK              0x00000002
#define _CFD2FIFOCON1_TFHRFHIE_LENGTH            0x00000001

#define _CFD2FIFOCON1_TFERFFIE_POSITION          0x00000002
#define _CFD2FIFOCON1_TFERFFIE_MASK              0x00000004
#define _CFD2FIFOCON1_TFERFFIE_LENGTH            0x00000001

#define _CFD2FIFOCON1_RXOVIE_POSITION            0x00000003
#define _CFD2FIFOCON1_RXOVIE_MASK                0x00000008
#define _CFD2FIFOCON1_RXOVIE_LENGTH              0x00000001

#define _CFD2FIFOCON1_TXATIE_POSITION            0x00000004
#define _CFD2FIFOCON1_TXATIE_MASK                0x00000010
#define _CFD2FIFOCON1_TXATIE_LENGTH              0x00000001

#define _CFD2FIFOCON1_RXTSEN_POSITION            0x00000005
#define _CFD2FIFOCON1_RXTSEN_MASK                0x00000020
#define _CFD2FIFOCON1_RXTSEN_LENGTH              0x00000001

#define _CFD2FIFOCON1_RTREN_POSITION             0x00000006
#define _CFD2FIFOCON1_RTREN_MASK                 0x00000040
#define _CFD2FIFOCON1_RTREN_LENGTH               0x00000001

#define _CFD2FIFOCON1_TXEN_POSITION              0x00000007
#define _CFD2FIFOCON1_TXEN_MASK                  0x00000080
#define _CFD2FIFOCON1_TXEN_LENGTH                0x00000001

#define _CFD2FIFOCON1_UINC_POSITION              0x00000008
#define _CFD2FIFOCON1_UINC_MASK                  0x00000100
#define _CFD2FIFOCON1_UINC_LENGTH                0x00000001

