Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpl064.h
#define _CFD2MASK0_MSID_POSITION                 0x00000000
#define _CFD2MASK0_MSID_MASK                     0x000007FF
#define _CFD2MASK0_MSID_LENGTH                   0x0000000B

#define _CFD2MASK0_MEID_POSITION                 0x0000000B
#define _CFD2MASK0_MEID_MASK                     0x1FFFF800
#define _CFD2MASK0_MEID_LENGTH                   0x00000012

#define _CFD2MASK0_MSID11_POSITION               0x0000001D
#define _CFD2MASK0_MSID11_MASK                   0x20000000
#define _CFD2MASK0_MSID11_LENGTH                 0x00000001

#define _CFD2MASK0_MIDE_POSITION                 0x0000001E
#define _CFD2MASK0_MIDE_MASK                     0x40000000
#define _CFD2MASK0_MIDE_LENGTH                   0x00000001

#define _CFD2FLTOBJ1_SID_POSITION                0x00000000
#define _CFD2FLTOBJ1_SID_MASK                    0x000007FF
#define _CFD2FLTOBJ1_SID_LENGTH                  0x0000000B

#define _CFD2FLTOBJ1_EID_POSITION                0x0000000B
#define _CFD2FLTOBJ1_EID_MASK                    0x1FFFF800
#define _CFD2FLTOBJ1_EID_LENGTH                  0x00000012

#define _CFD2FLTOBJ1_SID11_POSITION              0x0000001D
#define _CFD2FLTOBJ1_SID11_MASK                  0x20000000
#define _CFD2FLTOBJ1_SID11_LENGTH                0x00000001

#define _CFD2FLTOBJ1_EXIDE_POSITION              0x0000001E
#define _CFD2FLTOBJ1_EXIDE_MASK                  0x40000000
#define _CFD2FLTOBJ1_EXIDE_LENGTH                0x00000001

#define _CFD2MASK1_MSID_POSITION                 0x00000000
#define _CFD2MASK1_MSID_MASK                     0x000007FF
#define _CFD2MASK1_MSID_LENGTH                   0x0000000B

#define _CFD2MASK1_MEID_POSITION                 0x0000000B
#define _CFD2MASK1_MEID_MASK                     0x1FFFF800
#define _CFD2MASK1_MEID_LENGTH                   0x00000012

#define _CFD2MASK1_MSID11_POSITION               0x0000001D
#define _CFD2MASK1_MSID11_MASK                   0x20000000
#define _CFD2MASK1_MSID11_LENGTH                 0x00000001

#define _CFD2MASK1_MIDE_POSITION                 0x0000001E
#define _CFD2MASK1_MIDE_MASK                     0x40000000
#define _CFD2MASK1_MIDE_LENGTH                   0x00000001

#define _CFD2FLTOBJ2_SID_POSITION                0x00000000
#define _CFD2FLTOBJ2_SID_MASK                    0x000007FF
#define _CFD2FLTOBJ2_SID_LENGTH                  0x0000000B

#define _CFD2FLTOBJ2_EID_POSITION                0x0000000B
#define _CFD2FLTOBJ2_EID_MASK                    0x1FFFF800
#define _CFD2FLTOBJ2_EID_LENGTH                  0x00000012

#define _CFD2FLTOBJ2_SID11_POSITION              0x0000001D
#define _CFD2FLTOBJ2_SID11_MASK                  0x20000000
#define _CFD2FLTOBJ2_SID11_LENGTH                0x00000001

#define _CFD2FLTOBJ2_EXIDE_POSITION              0x0000001E
#define _CFD2FLTOBJ2_EXIDE_MASK                  0x40000000
#define _CFD2FLTOBJ2_EXIDE_LENGTH                0x00000001

#define _CFD2MASK2_MSID_POSITION                 0x00000000
#define _CFD2MASK2_MSID_MASK                     0x000007FF
#define _CFD2MASK2_MSID_LENGTH                   0x0000000B

#define _CFD2MASK2_MEID_POSITION                 0x0000000B
#define _CFD2MASK2_MEID_MASK                     0x1FFFF800
#define _CFD2MASK2_MEID_LENGTH                   0x00000012

#define _CFD2MASK2_MSID11_POSITION               0x0000001D
#define _CFD2MASK2_MSID11_MASK                   0x20000000
#define _CFD2MASK2_MSID11_LENGTH                 0x00000001

#define _CFD2MASK2_MIDE_POSITION                 0x0000001E
#define _CFD2MASK2_MIDE_MASK                     0x40000000
#define _CFD2MASK2_MIDE_LENGTH                   0x00000001

#define _CFD2FLTOBJ3_SID_POSITION                0x00000000
#define _CFD2FLTOBJ3_SID_MASK                    0x000007FF
#define _CFD2FLTOBJ3_SID_LENGTH                  0x0000000B

#define _CFD2FLTOBJ3_EID_POSITION                0x0000000B
#define _CFD2FLTOBJ3_EID_MASK                    0x1FFFF800
#define _CFD2FLTOBJ3_EID_LENGTH                  0x00000012

#define _CFD2FLTOBJ3_SID11_POSITION              0x0000001D
#define _CFD2FLTOBJ3_SID11_MASK                  0x20000000
#define _CFD2FLTOBJ3_SID11_LENGTH                0x00000001

#define _CFD2FLTOBJ3_EXIDE_POSITION              0x0000001E
#define _CFD2FLTOBJ3_EXIDE_MASK                  0x40000000
#define _CFD2FLTOBJ3_EXIDE_LENGTH                0x00000001

#define _CFD2MASK3_MSID_POSITION                 0x00000000
#define _CFD2MASK3_MSID_MASK                     0x000007FF
#define _CFD2MASK3_MSID_LENGTH                   0x0000000B

#define _CFD2MASK3_MEID_POSITION                 0x0000000B
#define _CFD2MASK3_MEID_MASK                     0x1FFFF800
#define _CFD2MASK3_MEID_LENGTH                   0x00000012

#define _CFD2MASK3_MSID11_POSITION               0x0000001D
#define _CFD2MASK3_MSID11_MASK                   0x20000000
#define _CFD2MASK3_MSID11_LENGTH                 0x00000001

#define _CFD2MASK3_MIDE_POSITION                 0x0000001E
#define _CFD2MASK3_MIDE_MASK                     0x40000000
#define _CFD2MASK3_MIDE_LENGTH                   0x00000001

#define _CFD2FLTOBJ4_SID_POSITION                0x00000000
#define _CFD2FLTOBJ4_SID_MASK                    0x000007FF
#define _CFD2FLTOBJ4_SID_LENGTH                  0x0000000B

#define _CFD2FLTOBJ4_EID_POSITION                0x0000000B
#define _CFD2FLTOBJ4_EID_MASK                    0x1FFFF800
#define _CFD2FLTOBJ4_EID_LENGTH                  0x00000012

#define _CFD2FLTOBJ4_SID11_POSITION              0x0000001D
#define _CFD2FLTOBJ4_SID11_MASK                  0x20000000
#define _CFD2FLTOBJ4_SID11_LENGTH                0x00000001

#define _CFD2FLTOBJ4_EXIDE_POSITION              0x0000001E
#define _CFD2FLTOBJ4_EXIDE_MASK                  0x40000000
#define _CFD2FLTOBJ4_EXIDE_LENGTH                0x00000001

#define _CFD2MASK4_MSID_POSITION                 0x00000000
#define _CFD2MASK4_MSID_MASK                     0x000007FF
#define _CFD2MASK4_MSID_LENGTH                   0x0000000B

#define _CFD2MASK4_MEID_POSITION                 0x0000000B
#define _CFD2MASK4_MEID_MASK                     0x1FFFF800
#define _CFD2MASK4_MEID_LENGTH                   0x00000012

#define _CFD2MASK4_MSID11_POSITION               0x0000001D
#define _CFD2MASK4_MSID11_MASK                   0x20000000
#define _CFD2MASK4_MSID11_LENGTH                 0x00000001

#define _CFD2MASK4_MIDE_POSITION                 0x0000001E
#define _CFD2MASK4_MIDE_MASK                     0x40000000
#define _CFD2MASK4_MIDE_LENGTH                   0x00000001

#define _CFD2FLTOBJ5_SID_POSITION                0x00000000
#define _CFD2FLTOBJ5_SID_MASK                    0x000007FF
#define _CFD2FLTOBJ5_SID_LENGTH                  0x0000000B

#define _CFD2FLTOBJ5_EID_POSITION                0x0000000B
#define _CFD2FLTOBJ5_EID_MASK                    0x1FFFF800
#define _CFD2FLTOBJ5_EID_LENGTH                  0x00000012

#define _CFD2FLTOBJ5_SID11_POSITION              0x0000001D
#define _CFD2FLTOBJ5_SID11_MASK                  0x20000000
#define _CFD2FLTOBJ5_SID11_LENGTH                0x00000001

#define _CFD2FLTOBJ5_EXIDE_POSITION              0x0000001E
#define _CFD2FLTOBJ5_EXIDE_MASK                  0x40000000
#define _CFD2FLTOBJ5_EXIDE_LENGTH                0x00000001

#define _CFD2MASK5_MSID_POSITION                 0x00000000
#define _CFD2MASK5_MSID_MASK                     0x000007FF
#define _CFD2MASK5_MSID_LENGTH                   0x0000000B

