Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpl064.h
#define _CFD2MASK5_MEID_POSITION                 0x0000000B
#define _CFD2MASK5_MEID_MASK                     0x1FFFF800
#define _CFD2MASK5_MEID_LENGTH                   0x00000012

#define _CFD2MASK5_MSID11_POSITION               0x0000001D
#define _CFD2MASK5_MSID11_MASK                   0x20000000
#define _CFD2MASK5_MSID11_LENGTH                 0x00000001

#define _CFD2MASK5_MIDE_POSITION                 0x0000001E
#define _CFD2MASK5_MIDE_MASK                     0x40000000
#define _CFD2MASK5_MIDE_LENGTH                   0x00000001

#define _CFD2FLTOBJ6_SID_POSITION                0x00000000
#define _CFD2FLTOBJ6_SID_MASK                    0x000007FF
#define _CFD2FLTOBJ6_SID_LENGTH                  0x0000000B

#define _CFD2FLTOBJ6_EID_POSITION                0x0000000B
#define _CFD2FLTOBJ6_EID_MASK                    0x1FFFF800
#define _CFD2FLTOBJ6_EID_LENGTH                  0x00000012

#define _CFD2FLTOBJ6_SID11_POSITION              0x0000001D
#define _CFD2FLTOBJ6_SID11_MASK                  0x20000000
#define _CFD2FLTOBJ6_SID11_LENGTH                0x00000001

#define _CFD2FLTOBJ6_EXIDE_POSITION              0x0000001E
#define _CFD2FLTOBJ6_EXIDE_MASK                  0x40000000
#define _CFD2FLTOBJ6_EXIDE_LENGTH                0x00000001

#define _CFD2MASK6_MSID_POSITION                 0x00000000
#define _CFD2MASK6_MSID_MASK                     0x000007FF
#define _CFD2MASK6_MSID_LENGTH                   0x0000000B

#define _CFD2MASK6_MEID_POSITION                 0x0000000B
#define _CFD2MASK6_MEID_MASK                     0x1FFFF800
#define _CFD2MASK6_MEID_LENGTH                   0x00000012

#define _CFD2MASK6_MSID11_POSITION               0x0000001D
#define _CFD2MASK6_MSID11_MASK                   0x20000000
#define _CFD2MASK6_MSID11_LENGTH                 0x00000001

#define _CFD2MASK6_MIDE_POSITION                 0x0000001E
#define _CFD2MASK6_MIDE_MASK                     0x40000000
#define _CFD2MASK6_MIDE_LENGTH                   0x00000001

#define _CFD2FLTOBJ7_SID_POSITION                0x00000000
#define _CFD2FLTOBJ7_SID_MASK                    0x000007FF
#define _CFD2FLTOBJ7_SID_LENGTH                  0x0000000B

#define _CFD2FLTOBJ7_EID_POSITION                0x0000000B
#define _CFD2FLTOBJ7_EID_MASK                    0x1FFFF800
#define _CFD2FLTOBJ7_EID_LENGTH                  0x00000012

#define _CFD2FLTOBJ7_SID11_POSITION              0x0000001D
#define _CFD2FLTOBJ7_SID11_MASK                  0x20000000
#define _CFD2FLTOBJ7_SID11_LENGTH                0x00000001

#define _CFD2FLTOBJ7_EXIDE_POSITION              0x0000001E
#define _CFD2FLTOBJ7_EXIDE_MASK                  0x40000000
#define _CFD2FLTOBJ7_EXIDE_LENGTH                0x00000001

#define _CFD2MASK7_MSID_POSITION                 0x00000000
#define _CFD2MASK7_MSID_MASK                     0x000007FF
#define _CFD2MASK7_MSID_LENGTH                   0x0000000B

#define _CFD2MASK7_MEID_POSITION                 0x0000000B
#define _CFD2MASK7_MEID_MASK                     0x1FFFF800
#define _CFD2MASK7_MEID_LENGTH                   0x00000012

#define _CFD2MASK7_MSID11_POSITION               0x0000001D
#define _CFD2MASK7_MSID11_MASK                   0x20000000
#define _CFD2MASK7_MSID11_LENGTH                 0x00000001

#define _CFD2MASK7_MIDE_POSITION                 0x0000001E
#define _CFD2MASK7_MIDE_MASK                     0x40000000
#define _CFD2MASK7_MIDE_LENGTH                   0x00000001

#define _CFD2FLTOBJ8_SID_POSITION                0x00000000
#define _CFD2FLTOBJ8_SID_MASK                    0x000007FF
#define _CFD2FLTOBJ8_SID_LENGTH                  0x0000000B

#define _CFD2FLTOBJ8_EID_POSITION                0x0000000B
#define _CFD2FLTOBJ8_EID_MASK                    0x1FFFF800
#define _CFD2FLTOBJ8_EID_LENGTH                  0x00000012

#define _CFD2FLTOBJ8_SID11_POSITION              0x0000001D
#define _CFD2FLTOBJ8_SID11_MASK                  0x20000000
#define _CFD2FLTOBJ8_SID11_LENGTH                0x00000001

#define _CFD2FLTOBJ8_EXIDE_POSITION              0x0000001E
#define _CFD2FLTOBJ8_EXIDE_MASK                  0x40000000
#define _CFD2FLTOBJ8_EXIDE_LENGTH                0x00000001

#define _CFD2MASK8_MSID_POSITION                 0x00000000
#define _CFD2MASK8_MSID_MASK                     0x000007FF
#define _CFD2MASK8_MSID_LENGTH                   0x0000000B

#define _CFD2MASK8_MEID_POSITION                 0x0000000B
#define _CFD2MASK8_MEID_MASK                     0x1FFFF800
#define _CFD2MASK8_MEID_LENGTH                   0x00000012

#define _CFD2MASK8_MSID11_POSITION               0x0000001D
#define _CFD2MASK8_MSID11_MASK                   0x20000000
#define _CFD2MASK8_MSID11_LENGTH                 0x00000001

#define _CFD2MASK8_MIDE_POSITION                 0x0000001E
#define _CFD2MASK8_MIDE_MASK                     0x40000000
#define _CFD2MASK8_MIDE_LENGTH                   0x00000001

#define _CFD2FLTOBJ9_SID_POSITION                0x00000000
#define _CFD2FLTOBJ9_SID_MASK                    0x000007FF
#define _CFD2FLTOBJ9_SID_LENGTH                  0x0000000B

#define _CFD2FLTOBJ9_EID_POSITION                0x0000000B
#define _CFD2FLTOBJ9_EID_MASK                    0x1FFFF800
#define _CFD2FLTOBJ9_EID_LENGTH                  0x00000012

#define _CFD2FLTOBJ9_SID11_POSITION              0x0000001D
#define _CFD2FLTOBJ9_SID11_MASK                  0x20000000
#define _CFD2FLTOBJ9_SID11_LENGTH                0x00000001

#define _CFD2FLTOBJ9_EXIDE_POSITION              0x0000001E
#define _CFD2FLTOBJ9_EXIDE_MASK                  0x40000000
#define _CFD2FLTOBJ9_EXIDE_LENGTH                0x00000001

#define _CFD2MASK9_MSID_POSITION                 0x00000000
#define _CFD2MASK9_MSID_MASK                     0x000007FF
#define _CFD2MASK9_MSID_LENGTH                   0x0000000B

#define _CFD2MASK9_MEID_POSITION                 0x0000000B
#define _CFD2MASK9_MEID_MASK                     0x1FFFF800
#define _CFD2MASK9_MEID_LENGTH                   0x00000012

#define _CFD2MASK9_MSID11_POSITION               0x0000001D
#define _CFD2MASK9_MSID11_MASK                   0x20000000
#define _CFD2MASK9_MSID11_LENGTH                 0x00000001

