Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpl064.h
#define _CFD2FLTOBJ24_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ24_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ24_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ24_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ24_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ24_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ24_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ24_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ24_EXIDE_LENGTH               0x00000001

#define _CFD2MASK24_MSID_POSITION                0x00000000
#define _CFD2MASK24_MSID_MASK                    0x000007FF
#define _CFD2MASK24_MSID_LENGTH                  0x0000000B

#define _CFD2MASK24_MEID_POSITION                0x0000000B
#define _CFD2MASK24_MEID_MASK                    0x1FFFF800
#define _CFD2MASK24_MEID_LENGTH                  0x00000012

#define _CFD2MASK24_MSID11_POSITION              0x0000001D
#define _CFD2MASK24_MSID11_MASK                  0x20000000
#define _CFD2MASK24_MSID11_LENGTH                0x00000001

#define _CFD2MASK24_MIDE_POSITION                0x0000001E
#define _CFD2MASK24_MIDE_MASK                    0x40000000
#define _CFD2MASK24_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ25_SID_POSITION               0x00000000
#define _CFD2FLTOBJ25_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ25_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ25_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ25_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ25_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ25_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ25_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ25_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ25_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ25_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ25_EXIDE_LENGTH               0x00000001

#define _CFD2MASK25_MSID_POSITION                0x00000000
#define _CFD2MASK25_MSID_MASK                    0x000007FF
#define _CFD2MASK25_MSID_LENGTH                  0x0000000B

#define _CFD2MASK25_MEID_POSITION                0x0000000B
#define _CFD2MASK25_MEID_MASK                    0x1FFFF800
#define _CFD2MASK25_MEID_LENGTH                  0x00000012

#define _CFD2MASK25_MSID11_POSITION              0x0000001D
#define _CFD2MASK25_MSID11_MASK                  0x20000000
#define _CFD2MASK25_MSID11_LENGTH                0x00000001

#define _CFD2MASK25_MIDE_POSITION                0x0000001E
#define _CFD2MASK25_MIDE_MASK                    0x40000000
#define _CFD2MASK25_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ26_SID_POSITION               0x00000000
#define _CFD2FLTOBJ26_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ26_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ26_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ26_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ26_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ26_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ26_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ26_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ26_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ26_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ26_EXIDE_LENGTH               0x00000001

#define _CFD2MASK26_MSID_POSITION                0x00000000
#define _CFD2MASK26_MSID_MASK                    0x000007FF
#define _CFD2MASK26_MSID_LENGTH                  0x0000000B

#define _CFD2MASK26_MEID_POSITION                0x0000000B
#define _CFD2MASK26_MEID_MASK                    0x1FFFF800
#define _CFD2MASK26_MEID_LENGTH                  0x00000012

#define _CFD2MASK26_MSID11_POSITION              0x0000001D
#define _CFD2MASK26_MSID11_MASK                  0x20000000
#define _CFD2MASK26_MSID11_LENGTH                0x00000001

#define _CFD2MASK26_MIDE_POSITION                0x0000001E
#define _CFD2MASK26_MIDE_MASK                    0x40000000
#define _CFD2MASK26_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ27_SID_POSITION               0x00000000
#define _CFD2FLTOBJ27_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ27_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ27_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ27_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ27_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ27_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ27_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ27_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ27_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ27_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ27_EXIDE_LENGTH               0x00000001

#define _CFD2MASK27_MSID_POSITION                0x00000000
#define _CFD2MASK27_MSID_MASK                    0x000007FF
#define _CFD2MASK27_MSID_LENGTH                  0x0000000B

#define _CFD2MASK27_MEID_POSITION                0x0000000B
#define _CFD2MASK27_MEID_MASK                    0x1FFFF800
#define _CFD2MASK27_MEID_LENGTH                  0x00000012

#define _CFD2MASK27_MSID11_POSITION              0x0000001D
#define _CFD2MASK27_MSID11_MASK                  0x20000000
#define _CFD2MASK27_MSID11_LENGTH                0x00000001

#define _CFD2MASK27_MIDE_POSITION                0x0000001E
#define _CFD2MASK27_MIDE_MASK                    0x40000000
#define _CFD2MASK27_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ28_SID_POSITION               0x00000000
#define _CFD2FLTOBJ28_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ28_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ28_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ28_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ28_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ28_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ28_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ28_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ28_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ28_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ28_EXIDE_LENGTH               0x00000001

#define _CFD2MASK28_MSID_POSITION                0x00000000
#define _CFD2MASK28_MSID_MASK                    0x000007FF
#define _CFD2MASK28_MSID_LENGTH                  0x0000000B

#define _CFD2MASK28_MEID_POSITION                0x0000000B
#define _CFD2MASK28_MEID_MASK                    0x1FFFF800
#define _CFD2MASK28_MEID_LENGTH                  0x00000012

#define _CFD2MASK28_MSID11_POSITION              0x0000001D
#define _CFD2MASK28_MSID11_MASK                  0x20000000
#define _CFD2MASK28_MSID11_LENGTH                0x00000001

#define _CFD2MASK28_MIDE_POSITION                0x0000001E
#define _CFD2MASK28_MIDE_MASK                    0x40000000
#define _CFD2MASK28_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ29_SID_POSITION               0x00000000
#define _CFD2FLTOBJ29_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ29_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ29_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ29_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ29_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ29_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ29_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ29_SID11_LENGTH               0x00000001

