Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpl064.h
#define _CFD3FIFOCON24_FRESET_POSITION           0x0000000A
#define _CFD3FIFOCON24_FRESET_MASK               0x00000400
#define _CFD3FIFOCON24_FRESET_LENGTH             0x00000001

#define _CFD3FIFOCON24_TXPRI_POSITION            0x00000010
#define _CFD3FIFOCON24_TXPRI_MASK                0x001F0000
#define _CFD3FIFOCON24_TXPRI_LENGTH              0x00000005

#define _CFD3FIFOCON24_TXAT_POSITION             0x00000015
#define _CFD3FIFOCON24_TXAT_MASK                 0x00600000
#define _CFD3FIFOCON24_TXAT_LENGTH               0x00000002

#define _CFD3FIFOCON24_FSIZE_POSITION            0x00000018
#define _CFD3FIFOCON24_FSIZE_MASK                0x1F000000
#define _CFD3FIFOCON24_FSIZE_LENGTH              0x00000005

#define _CFD3FIFOCON24_PLSIZE_POSITION           0x0000001D
#define _CFD3FIFOCON24_PLSIZE_MASK               0xE0000000
#define _CFD3FIFOCON24_PLSIZE_LENGTH             0x00000003

#define _CFD3FIFOSTA24_TFNRFNIF_POSITION         0x00000000
#define _CFD3FIFOSTA24_TFNRFNIF_MASK             0x00000001
#define _CFD3FIFOSTA24_TFNRFNIF_LENGTH           0x00000001

#define _CFD3FIFOSTA24_TFHRFHIF_POSITION         0x00000001
#define _CFD3FIFOSTA24_TFHRFHIF_MASK             0x00000002
#define _CFD3FIFOSTA24_TFHRFHIF_LENGTH           0x00000001

#define _CFD3FIFOSTA24_TFERFFIF_POSITION         0x00000002
#define _CFD3FIFOSTA24_TFERFFIF_MASK             0x00000004
#define _CFD3FIFOSTA24_TFERFFIF_LENGTH           0x00000001

#define _CFD3FIFOSTA24_RXOVIF_POSITION           0x00000003
#define _CFD3FIFOSTA24_RXOVIF_MASK               0x00000008
#define _CFD3FIFOSTA24_RXOVIF_LENGTH             0x00000001

#define _CFD3FIFOSTA24_TXATIF_POSITION           0x00000004
#define _CFD3FIFOSTA24_TXATIF_MASK               0x00000010
#define _CFD3FIFOSTA24_TXATIF_LENGTH             0x00000001

#define _CFD3FIFOSTA24_TXERR_POSITION            0x00000005
#define _CFD3FIFOSTA24_TXERR_MASK                0x00000020
#define _CFD3FIFOSTA24_TXERR_LENGTH              0x00000001

#define _CFD3FIFOSTA24_TXLARB_POSITION           0x00000006
#define _CFD3FIFOSTA24_TXLARB_MASK               0x00000040
#define _CFD3FIFOSTA24_TXLARB_LENGTH             0x00000001

#define _CFD3FIFOSTA24_TXABT_POSITION            0x00000007
#define _CFD3FIFOSTA24_TXABT_MASK                0x00000080
#define _CFD3FIFOSTA24_TXABT_LENGTH              0x00000001

#define _CFD3FIFOSTA24_FIFOCI_POSITION           0x00000008
#define _CFD3FIFOSTA24_FIFOCI_MASK               0x00001F00
#define _CFD3FIFOSTA24_FIFOCI_LENGTH             0x00000005

#define _CFD3FIFOUA24_FIFOUA_POSITION            0x00000000
#define _CFD3FIFOUA24_FIFOUA_MASK                0xFFFFFFFF
#define _CFD3FIFOUA24_FIFOUA_LENGTH              0x00000020

#define _CFD3FIFOCON25_TFNRFNIE_POSITION         0x00000000
#define _CFD3FIFOCON25_TFNRFNIE_MASK             0x00000001
#define _CFD3FIFOCON25_TFNRFNIE_LENGTH           0x00000001

#define _CFD3FIFOCON25_TFHRFHIE_POSITION         0x00000001
#define _CFD3FIFOCON25_TFHRFHIE_MASK             0x00000002
#define _CFD3FIFOCON25_TFHRFHIE_LENGTH           0x00000001

#define _CFD3FIFOCON25_TFERFFIE_POSITION         0x00000002
#define _CFD3FIFOCON25_TFERFFIE_MASK             0x00000004
#define _CFD3FIFOCON25_TFERFFIE_LENGTH           0x00000001

#define _CFD3FIFOCON25_RXOVIE_POSITION           0x00000003
#define _CFD3FIFOCON25_RXOVIE_MASK               0x00000008
#define _CFD3FIFOCON25_RXOVIE_LENGTH             0x00000001

#define _CFD3FIFOCON25_TXATIE_POSITION           0x00000004
#define _CFD3FIFOCON25_TXATIE_MASK               0x00000010
#define _CFD3FIFOCON25_TXATIE_LENGTH             0x00000001

#define _CFD3FIFOCON25_RXTSEN_POSITION           0x00000005
#define _CFD3FIFOCON25_RXTSEN_MASK               0x00000020
#define _CFD3FIFOCON25_RXTSEN_LENGTH             0x00000001

#define _CFD3FIFOCON25_RTREN_POSITION            0x00000006
#define _CFD3FIFOCON25_RTREN_MASK                0x00000040
#define _CFD3FIFOCON25_RTREN_LENGTH              0x00000001

#define _CFD3FIFOCON25_TXEN_POSITION             0x00000007
#define _CFD3FIFOCON25_TXEN_MASK                 0x00000080
#define _CFD3FIFOCON25_TXEN_LENGTH               0x00000001

#define _CFD3FIFOCON25_UINC_POSITION             0x00000008
#define _CFD3FIFOCON25_UINC_MASK                 0x00000100
#define _CFD3FIFOCON25_UINC_LENGTH               0x00000001

#define _CFD3FIFOCON25_TXREQ_POSITION            0x00000009
#define _CFD3FIFOCON25_TXREQ_MASK                0x00000200
#define _CFD3FIFOCON25_TXREQ_LENGTH              0x00000001

#define _CFD3FIFOCON25_FRESET_POSITION           0x0000000A
#define _CFD3FIFOCON25_FRESET_MASK               0x00000400
#define _CFD3FIFOCON25_FRESET_LENGTH             0x00000001

#define _CFD3FIFOCON25_TXPRI_POSITION            0x00000010
#define _CFD3FIFOCON25_TXPRI_MASK                0x001F0000
#define _CFD3FIFOCON25_TXPRI_LENGTH              0x00000005

#define _CFD3FIFOCON25_TXAT_POSITION             0x00000015
#define _CFD3FIFOCON25_TXAT_MASK                 0x00600000
#define _CFD3FIFOCON25_TXAT_LENGTH               0x00000002

#define _CFD3FIFOCON25_FSIZE_POSITION            0x00000018
#define _CFD3FIFOCON25_FSIZE_MASK                0x1F000000
#define _CFD3FIFOCON25_FSIZE_LENGTH              0x00000005

#define _CFD3FIFOCON25_PLSIZE_POSITION           0x0000001D
#define _CFD3FIFOCON25_PLSIZE_MASK               0xE0000000
#define _CFD3FIFOCON25_PLSIZE_LENGTH             0x00000003

#define _CFD3FIFOSTA25_TFNRFNIF_POSITION         0x00000000
#define _CFD3FIFOSTA25_TFNRFNIF_MASK             0x00000001
#define _CFD3FIFOSTA25_TFNRFNIF_LENGTH           0x00000001

#define _CFD3FIFOSTA25_TFHRFHIF_POSITION         0x00000001
#define _CFD3FIFOSTA25_TFHRFHIF_MASK             0x00000002
#define _CFD3FIFOSTA25_TFHRFHIF_LENGTH           0x00000001

#define _CFD3FIFOSTA25_TFERFFIF_POSITION         0x00000002
#define _CFD3FIFOSTA25_TFERFFIF_MASK             0x00000004
#define _CFD3FIFOSTA25_TFERFFIF_LENGTH           0x00000001

#define _CFD3FIFOSTA25_RXOVIF_POSITION           0x00000003
#define _CFD3FIFOSTA25_RXOVIF_MASK               0x00000008
#define _CFD3FIFOSTA25_RXOVIF_LENGTH             0x00000001

#define _CFD3FIFOSTA25_TXATIF_POSITION           0x00000004
#define _CFD3FIFOSTA25_TXATIF_MASK               0x00000010
#define _CFD3FIFOSTA25_TXATIF_LENGTH             0x00000001

#define _CFD3FIFOSTA25_TXERR_POSITION            0x00000005
#define _CFD3FIFOSTA25_TXERR_MASK                0x00000020
#define _CFD3FIFOSTA25_TXERR_LENGTH              0x00000001

#define _CFD3FIFOSTA25_TXLARB_POSITION           0x00000006
#define _CFD3FIFOSTA25_TXLARB_MASK               0x00000040
#define _CFD3FIFOSTA25_TXLARB_LENGTH             0x00000001

#define _CFD3FIFOSTA25_TXABT_POSITION            0x00000007
#define _CFD3FIFOSTA25_TXABT_MASK                0x00000080
#define _CFD3FIFOSTA25_TXABT_LENGTH              0x00000001

#define _CFD3FIFOSTA25_FIFOCI_POSITION           0x00000008
#define _CFD3FIFOSTA25_FIFOCI_MASK               0x00001F00
#define _CFD3FIFOSTA25_FIFOCI_LENGTH             0x00000005

#define _CFD3FIFOUA25_FIFOUA_POSITION            0x00000000
#define _CFD3FIFOUA25_FIFOUA_MASK                0xFFFFFFFF
#define _CFD3FIFOUA25_FIFOUA_LENGTH              0x00000020

#define _CFD3FIFOCON26_TFNRFNIE_POSITION         0x00000000
#define _CFD3FIFOCON26_TFNRFNIE_MASK             0x00000001
#define _CFD3FIFOCON26_TFNRFNIE_LENGTH           0x00000001

#define _CFD3FIFOCON26_TFHRFHIE_POSITION         0x00000001
#define _CFD3FIFOCON26_TFHRFHIE_MASK             0x00000002
#define _CFD3FIFOCON26_TFHRFHIE_LENGTH           0x00000001

#define _CFD3FIFOCON26_TFERFFIE_POSITION         0x00000002
#define _CFD3FIFOCON26_TFERFFIE_MASK             0x00000004
#define _CFD3FIFOCON26_TFERFFIE_LENGTH           0x00000001

#define _CFD3FIFOCON26_RXOVIE_POSITION           0x00000003
#define _CFD3FIFOCON26_RXOVIE_MASK               0x00000008
#define _CFD3FIFOCON26_RXOVIE_LENGTH             0x00000001

#define _CFD3FIFOCON26_TXATIE_POSITION           0x00000004
#define _CFD3FIFOCON26_TXATIE_MASK               0x00000010
#define _CFD3FIFOCON26_TXATIE_LENGTH             0x00000001

