Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpl064.h
#define _CFD3FLTOBJ23_EXIDE_POSITION             0x0000001E
#define _CFD3FLTOBJ23_EXIDE_MASK                 0x40000000
#define _CFD3FLTOBJ23_EXIDE_LENGTH               0x00000001

#define _CFD3MASK23_MSID_POSITION                0x00000000
#define _CFD3MASK23_MSID_MASK                    0x000007FF
#define _CFD3MASK23_MSID_LENGTH                  0x0000000B

#define _CFD3MASK23_MEID_POSITION                0x0000000B
#define _CFD3MASK23_MEID_MASK                    0x1FFFF800
#define _CFD3MASK23_MEID_LENGTH                  0x00000012

#define _CFD3MASK23_MSID11_POSITION              0x0000001D
#define _CFD3MASK23_MSID11_MASK                  0x20000000
#define _CFD3MASK23_MSID11_LENGTH                0x00000001

#define _CFD3MASK23_MIDE_POSITION                0x0000001E
#define _CFD3MASK23_MIDE_MASK                    0x40000000
#define _CFD3MASK23_MIDE_LENGTH                  0x00000001

#define _CFD3FLTOBJ24_SID_POSITION               0x00000000
#define _CFD3FLTOBJ24_SID_MASK                   0x000007FF
#define _CFD3FLTOBJ24_SID_LENGTH                 0x0000000B

#define _CFD3FLTOBJ24_EID_POSITION               0x0000000B
#define _CFD3FLTOBJ24_EID_MASK                   0x1FFFF800
#define _CFD3FLTOBJ24_EID_LENGTH                 0x00000012

#define _CFD3FLTOBJ24_SID11_POSITION             0x0000001D
#define _CFD3FLTOBJ24_SID11_MASK                 0x20000000
#define _CFD3FLTOBJ24_SID11_LENGTH               0x00000001

#define _CFD3FLTOBJ24_EXIDE_POSITION             0x0000001E
#define _CFD3FLTOBJ24_EXIDE_MASK                 0x40000000
#define _CFD3FLTOBJ24_EXIDE_LENGTH               0x00000001

#define _CFD3MASK24_MSID_POSITION                0x00000000
#define _CFD3MASK24_MSID_MASK                    0x000007FF
#define _CFD3MASK24_MSID_LENGTH                  0x0000000B

#define _CFD3MASK24_MEID_POSITION                0x0000000B
#define _CFD3MASK24_MEID_MASK                    0x1FFFF800
#define _CFD3MASK24_MEID_LENGTH                  0x00000012

#define _CFD3MASK24_MSID11_POSITION              0x0000001D
#define _CFD3MASK24_MSID11_MASK                  0x20000000
#define _CFD3MASK24_MSID11_LENGTH                0x00000001

#define _CFD3MASK24_MIDE_POSITION                0x0000001E
#define _CFD3MASK24_MIDE_MASK                    0x40000000
#define _CFD3MASK24_MIDE_LENGTH                  0x00000001

#define _CFD3FLTOBJ25_SID_POSITION               0x00000000
#define _CFD3FLTOBJ25_SID_MASK                   0x000007FF
#define _CFD3FLTOBJ25_SID_LENGTH                 0x0000000B

#define _CFD3FLTOBJ25_EID_POSITION               0x0000000B
#define _CFD3FLTOBJ25_EID_MASK                   0x1FFFF800
#define _CFD3FLTOBJ25_EID_LENGTH                 0x00000012

#define _CFD3FLTOBJ25_SID11_POSITION             0x0000001D
#define _CFD3FLTOBJ25_SID11_MASK                 0x20000000
#define _CFD3FLTOBJ25_SID11_LENGTH               0x00000001

#define _CFD3FLTOBJ25_EXIDE_POSITION             0x0000001E
#define _CFD3FLTOBJ25_EXIDE_MASK                 0x40000000
#define _CFD3FLTOBJ25_EXIDE_LENGTH               0x00000001

#define _CFD3MASK25_MSID_POSITION                0x00000000
#define _CFD3MASK25_MSID_MASK                    0x000007FF
#define _CFD3MASK25_MSID_LENGTH                  0x0000000B

#define _CFD3MASK25_MEID_POSITION                0x0000000B
#define _CFD3MASK25_MEID_MASK                    0x1FFFF800
#define _CFD3MASK25_MEID_LENGTH                  0x00000012

#define _CFD3MASK25_MSID11_POSITION              0x0000001D
#define _CFD3MASK25_MSID11_MASK                  0x20000000
#define _CFD3MASK25_MSID11_LENGTH                0x00000001

#define _CFD3MASK25_MIDE_POSITION                0x0000001E
#define _CFD3MASK25_MIDE_MASK                    0x40000000
#define _CFD3MASK25_MIDE_LENGTH                  0x00000001

#define _CFD3FLTOBJ26_SID_POSITION               0x00000000
#define _CFD3FLTOBJ26_SID_MASK                   0x000007FF
#define _CFD3FLTOBJ26_SID_LENGTH                 0x0000000B

#define _CFD3FLTOBJ26_EID_POSITION               0x0000000B
#define _CFD3FLTOBJ26_EID_MASK                   0x1FFFF800
#define _CFD3FLTOBJ26_EID_LENGTH                 0x00000012

#define _CFD3FLTOBJ26_SID11_POSITION             0x0000001D
#define _CFD3FLTOBJ26_SID11_MASK                 0x20000000
#define _CFD3FLTOBJ26_SID11_LENGTH               0x00000001

#define _CFD3FLTOBJ26_EXIDE_POSITION             0x0000001E
#define _CFD3FLTOBJ26_EXIDE_MASK                 0x40000000
#define _CFD3FLTOBJ26_EXIDE_LENGTH               0x00000001

#define _CFD3MASK26_MSID_POSITION                0x00000000
#define _CFD3MASK26_MSID_MASK                    0x000007FF
#define _CFD3MASK26_MSID_LENGTH                  0x0000000B

#define _CFD3MASK26_MEID_POSITION                0x0000000B
#define _CFD3MASK26_MEID_MASK                    0x1FFFF800
#define _CFD3MASK26_MEID_LENGTH                  0x00000012

#define _CFD3MASK26_MSID11_POSITION              0x0000001D
#define _CFD3MASK26_MSID11_MASK                  0x20000000
#define _CFD3MASK26_MSID11_LENGTH                0x00000001

#define _CFD3MASK26_MIDE_POSITION                0x0000001E
#define _CFD3MASK26_MIDE_MASK                    0x40000000
#define _CFD3MASK26_MIDE_LENGTH                  0x00000001

#define _CFD3FLTOBJ27_SID_POSITION               0x00000000
#define _CFD3FLTOBJ27_SID_MASK                   0x000007FF
#define _CFD3FLTOBJ27_SID_LENGTH                 0x0000000B

#define _CFD3FLTOBJ27_EID_POSITION               0x0000000B
#define _CFD3FLTOBJ27_EID_MASK                   0x1FFFF800
#define _CFD3FLTOBJ27_EID_LENGTH                 0x00000012

#define _CFD3FLTOBJ27_SID11_POSITION             0x0000001D
#define _CFD3FLTOBJ27_SID11_MASK                 0x20000000
#define _CFD3FLTOBJ27_SID11_LENGTH               0x00000001

#define _CFD3FLTOBJ27_EXIDE_POSITION             0x0000001E
#define _CFD3FLTOBJ27_EXIDE_MASK                 0x40000000
#define _CFD3FLTOBJ27_EXIDE_LENGTH               0x00000001

#define _CFD3MASK27_MSID_POSITION                0x00000000
#define _CFD3MASK27_MSID_MASK                    0x000007FF
#define _CFD3MASK27_MSID_LENGTH                  0x0000000B

