Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpl064.h
#define _CFD4TXQCON_TXEN_POSITION                0x00000007
#define _CFD4TXQCON_TXEN_MASK                    0x00000080
#define _CFD4TXQCON_TXEN_LENGTH                  0x00000001

#define _CFD4TXQCON_UINC_POSITION                0x00000008
#define _CFD4TXQCON_UINC_MASK                    0x00000100
#define _CFD4TXQCON_UINC_LENGTH                  0x00000001

#define _CFD4TXQCON_TXREQ_POSITION               0x00000009
#define _CFD4TXQCON_TXREQ_MASK                   0x00000200
#define _CFD4TXQCON_TXREQ_LENGTH                 0x00000001

#define _CFD4TXQCON_FRESET_POSITION              0x0000000A
#define _CFD4TXQCON_FRESET_MASK                  0x00000400
#define _CFD4TXQCON_FRESET_LENGTH                0x00000001

#define _CFD4TXQCON_TXPRI_POSITION               0x00000010
#define _CFD4TXQCON_TXPRI_MASK                   0x001F0000
#define _CFD4TXQCON_TXPRI_LENGTH                 0x00000005

#define _CFD4TXQCON_TXAT_POSITION                0x00000015
#define _CFD4TXQCON_TXAT_MASK                    0x00600000
#define _CFD4TXQCON_TXAT_LENGTH                  0x00000002

#define _CFD4TXQCON_FSIZE_POSITION               0x00000018
#define _CFD4TXQCON_FSIZE_MASK                   0x1F000000
#define _CFD4TXQCON_FSIZE_LENGTH                 0x00000005

#define _CFD4TXQCON_PLSIZE_POSITION              0x0000001D
#define _CFD4TXQCON_PLSIZE_MASK                  0xE0000000
#define _CFD4TXQCON_PLSIZE_LENGTH                0x00000003

#define _CFD4TXQSTA_TXQNIF_POSITION              0x00000000
#define _CFD4TXQSTA_TXQNIF_MASK                  0x00000001
#define _CFD4TXQSTA_TXQNIF_LENGTH                0x00000001

#define _CFD4TXQSTA_TXQEIF_POSITION              0x00000002
#define _CFD4TXQSTA_TXQEIF_MASK                  0x00000004
#define _CFD4TXQSTA_TXQEIF_LENGTH                0x00000001

#define _CFD4TXQSTA_TXATIF_POSITION              0x00000004
#define _CFD4TXQSTA_TXATIF_MASK                  0x00000010
#define _CFD4TXQSTA_TXATIF_LENGTH                0x00000001

#define _CFD4TXQSTA_TXERR_POSITION               0x00000005
#define _CFD4TXQSTA_TXERR_MASK                   0x00000020
#define _CFD4TXQSTA_TXERR_LENGTH                 0x00000001

#define _CFD4TXQSTA_TXLARB_POSITION              0x00000006
#define _CFD4TXQSTA_TXLARB_MASK                  0x00000040
#define _CFD4TXQSTA_TXLARB_LENGTH                0x00000001

#define _CFD4TXQSTA_TXABT_POSITION               0x00000007
#define _CFD4TXQSTA_TXABT_MASK                   0x00000080
#define _CFD4TXQSTA_TXABT_LENGTH                 0x00000001

#define _CFD4TXQSTA_TXQCI_POSITION               0x00000008
#define _CFD4TXQSTA_TXQCI_MASK                   0x00001F00
#define _CFD4TXQSTA_TXQCI_LENGTH                 0x00000005

#define _CFD4TXQUA_TXQUA_POSITION                0x00000000
#define _CFD4TXQUA_TXQUA_MASK                    0xFFFFFFFF
#define _CFD4TXQUA_TXQUA_LENGTH                  0x00000020

#define _CFD4FIFOCON1_TFNRFNIE_POSITION          0x00000000
#define _CFD4FIFOCON1_TFNRFNIE_MASK              0x00000001
#define _CFD4FIFOCON1_TFNRFNIE_LENGTH            0x00000001

#define _CFD4FIFOCON1_TFHRFHIE_POSITION          0x00000001
#define _CFD4FIFOCON1_TFHRFHIE_MASK              0x00000002
#define _CFD4FIFOCON1_TFHRFHIE_LENGTH            0x00000001

#define _CFD4FIFOCON1_TFERFFIE_POSITION          0x00000002
#define _CFD4FIFOCON1_TFERFFIE_MASK              0x00000004
#define _CFD4FIFOCON1_TFERFFIE_LENGTH            0x00000001

#define _CFD4FIFOCON1_RXOVIE_POSITION            0x00000003
#define _CFD4FIFOCON1_RXOVIE_MASK                0x00000008
#define _CFD4FIFOCON1_RXOVIE_LENGTH              0x00000001

#define _CFD4FIFOCON1_TXATIE_POSITION            0x00000004
#define _CFD4FIFOCON1_TXATIE_MASK                0x00000010
#define _CFD4FIFOCON1_TXATIE_LENGTH              0x00000001

#define _CFD4FIFOCON1_RXTSEN_POSITION            0x00000005
#define _CFD4FIFOCON1_RXTSEN_MASK                0x00000020
#define _CFD4FIFOCON1_RXTSEN_LENGTH              0x00000001

#define _CFD4FIFOCON1_RTREN_POSITION             0x00000006
#define _CFD4FIFOCON1_RTREN_MASK                 0x00000040
#define _CFD4FIFOCON1_RTREN_LENGTH               0x00000001

#define _CFD4FIFOCON1_TXEN_POSITION              0x00000007
#define _CFD4FIFOCON1_TXEN_MASK                  0x00000080
#define _CFD4FIFOCON1_TXEN_LENGTH                0x00000001

#define _CFD4FIFOCON1_UINC_POSITION              0x00000008
#define _CFD4FIFOCON1_UINC_MASK                  0x00000100
#define _CFD4FIFOCON1_UINC_LENGTH                0x00000001

#define _CFD4FIFOCON1_TXREQ_POSITION             0x00000009
#define _CFD4FIFOCON1_TXREQ_MASK                 0x00000200
#define _CFD4FIFOCON1_TXREQ_LENGTH               0x00000001

#define _CFD4FIFOCON1_FRESET_POSITION            0x0000000A
#define _CFD4FIFOCON1_FRESET_MASK                0x00000400
#define _CFD4FIFOCON1_FRESET_LENGTH              0x00000001

#define _CFD4FIFOCON1_TXPRI_POSITION             0x00000010
#define _CFD4FIFOCON1_TXPRI_MASK                 0x001F0000
#define _CFD4FIFOCON1_TXPRI_LENGTH               0x00000005

#define _CFD4FIFOCON1_TXAT_POSITION              0x00000015
#define _CFD4FIFOCON1_TXAT_MASK                  0x00600000
#define _CFD4FIFOCON1_TXAT_LENGTH                0x00000002

#define _CFD4FIFOCON1_FSIZE_POSITION             0x00000018
#define _CFD4FIFOCON1_FSIZE_MASK                 0x1F000000
#define _CFD4FIFOCON1_FSIZE_LENGTH               0x00000005

#define _CFD4FIFOCON1_PLSIZE_POSITION            0x0000001D
#define _CFD4FIFOCON1_PLSIZE_MASK                0xE0000000
#define _CFD4FIFOCON1_PLSIZE_LENGTH              0x00000003

#define _CFD4FIFOSTA1_TFNRFNIF_POSITION          0x00000000
#define _CFD4FIFOSTA1_TFNRFNIF_MASK              0x00000001
#define _CFD4FIFOSTA1_TFNRFNIF_LENGTH            0x00000001

#define _CFD4FIFOSTA1_TFHRFHIF_POSITION          0x00000001
#define _CFD4FIFOSTA1_TFHRFHIF_MASK              0x00000002
#define _CFD4FIFOSTA1_TFHRFHIF_LENGTH            0x00000001

#define _CFD4FIFOSTA1_TFERFFIF_POSITION          0x00000002
#define _CFD4FIFOSTA1_TFERFFIF_MASK              0x00000004
#define _CFD4FIFOSTA1_TFERFFIF_LENGTH            0x00000001

#define _CFD4FIFOSTA1_RXOVIF_POSITION            0x00000003
#define _CFD4FIFOSTA1_RXOVIF_MASK                0x00000008
#define _CFD4FIFOSTA1_RXOVIF_LENGTH              0x00000001

#define _CFD4FIFOSTA1_TXATIF_POSITION            0x00000004
#define _CFD4FIFOSTA1_TXATIF_MASK                0x00000010
#define _CFD4FIFOSTA1_TXATIF_LENGTH              0x00000001

