Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk1024gpl064.h
#define _CFD4FIFOSTA1_TXERR_POSITION             0x00000005
#define _CFD4FIFOSTA1_TXERR_MASK                 0x00000020
#define _CFD4FIFOSTA1_TXERR_LENGTH               0x00000001

#define _CFD4FIFOSTA1_TXLARB_POSITION            0x00000006
#define _CFD4FIFOSTA1_TXLARB_MASK                0x00000040
#define _CFD4FIFOSTA1_TXLARB_LENGTH              0x00000001

#define _CFD4FIFOSTA1_TXABT_POSITION             0x00000007
#define _CFD4FIFOSTA1_TXABT_MASK                 0x00000080
#define _CFD4FIFOSTA1_TXABT_LENGTH               0x00000001

#define _CFD4FIFOSTA1_FIFOCI_POSITION            0x00000008
#define _CFD4FIFOSTA1_FIFOCI_MASK                0x00001F00
#define _CFD4FIFOSTA1_FIFOCI_LENGTH              0x00000005

#define _CFD4FIFOUA1_FIFOUA_POSITION             0x00000000
#define _CFD4FIFOUA1_FIFOUA_MASK                 0xFFFFFFFF
#define _CFD4FIFOUA1_FIFOUA_LENGTH               0x00000020

#define _CFD4FIFOCON2_TFNRFNIE_POSITION          0x00000000
#define _CFD4FIFOCON2_TFNRFNIE_MASK              0x00000001
#define _CFD4FIFOCON2_TFNRFNIE_LENGTH            0x00000001

#define _CFD4FIFOCON2_TFHRFHIE_POSITION          0x00000001
#define _CFD4FIFOCON2_TFHRFHIE_MASK              0x00000002
#define _CFD4FIFOCON2_TFHRFHIE_LENGTH            0x00000001

#define _CFD4FIFOCON2_TFERFFIE_POSITION          0x00000002
#define _CFD4FIFOCON2_TFERFFIE_MASK              0x00000004
#define _CFD4FIFOCON2_TFERFFIE_LENGTH            0x00000001

#define _CFD4FIFOCON2_RXOVIE_POSITION            0x00000003
#define _CFD4FIFOCON2_RXOVIE_MASK                0x00000008
#define _CFD4FIFOCON2_RXOVIE_LENGTH              0x00000001

#define _CFD4FIFOCON2_TXATIE_POSITION            0x00000004
#define _CFD4FIFOCON2_TXATIE_MASK                0x00000010
#define _CFD4FIFOCON2_TXATIE_LENGTH              0x00000001

#define _CFD4FIFOCON2_RXTSEN_POSITION            0x00000005
#define _CFD4FIFOCON2_RXTSEN_MASK                0x00000020
#define _CFD4FIFOCON2_RXTSEN_LENGTH              0x00000001

#define _CFD4FIFOCON2_RTREN_POSITION             0x00000006
#define _CFD4FIFOCON2_RTREN_MASK                 0x00000040
#define _CFD4FIFOCON2_RTREN_LENGTH               0x00000001

#define _CFD4FIFOCON2_TXEN_POSITION              0x00000007
#define _CFD4FIFOCON2_TXEN_MASK                  0x00000080
#define _CFD4FIFOCON2_TXEN_LENGTH                0x00000001

#define _CFD4FIFOCON2_UINC_POSITION              0x00000008
#define _CFD4FIFOCON2_UINC_MASK                  0x00000100
#define _CFD4FIFOCON2_UINC_LENGTH                0x00000001

#define _CFD4FIFOCON2_TXREQ_POSITION             0x00000009
#define _CFD4FIFOCON2_TXREQ_MASK                 0x00000200
#define _CFD4FIFOCON2_TXREQ_LENGTH               0x00000001

#define _CFD4FIFOCON2_FRESET_POSITION            0x0000000A
#define _CFD4FIFOCON2_FRESET_MASK                0x00000400
#define _CFD4FIFOCON2_FRESET_LENGTH              0x00000001

#define _CFD4FIFOCON2_TXPRI_POSITION             0x00000010
#define _CFD4FIFOCON2_TXPRI_MASK                 0x001F0000
#define _CFD4FIFOCON2_TXPRI_LENGTH               0x00000005

#define _CFD4FIFOCON2_TXAT_POSITION              0x00000015
#define _CFD4FIFOCON2_TXAT_MASK                  0x00600000
#define _CFD4FIFOCON2_TXAT_LENGTH                0x00000002

#define _CFD4FIFOCON2_FSIZE_POSITION             0x00000018
#define _CFD4FIFOCON2_FSIZE_MASK                 0x1F000000
#define _CFD4FIFOCON2_FSIZE_LENGTH               0x00000005

#define _CFD4FIFOCON2_PLSIZE_POSITION            0x0000001D
#define _CFD4FIFOCON2_PLSIZE_MASK                0xE0000000
#define _CFD4FIFOCON2_PLSIZE_LENGTH              0x00000003

#define _CFD4FIFOSTA2_TFNRFNIF_POSITION          0x00000000
#define _CFD4FIFOSTA2_TFNRFNIF_MASK              0x00000001
#define _CFD4FIFOSTA2_TFNRFNIF_LENGTH            0x00000001

#define _CFD4FIFOSTA2_TFHRFHIF_POSITION          0x00000001
#define _CFD4FIFOSTA2_TFHRFHIF_MASK              0x00000002
#define _CFD4FIFOSTA2_TFHRFHIF_LENGTH            0x00000001

#define _CFD4FIFOSTA2_TFERFFIF_POSITION          0x00000002
#define _CFD4FIFOSTA2_TFERFFIF_MASK              0x00000004
#define _CFD4FIFOSTA2_TFERFFIF_LENGTH            0x00000001

#define _CFD4FIFOSTA2_RXOVIF_POSITION            0x00000003
#define _CFD4FIFOSTA2_RXOVIF_MASK                0x00000008
#define _CFD4FIFOSTA2_RXOVIF_LENGTH              0x00000001

#define _CFD4FIFOSTA2_TXATIF_POSITION            0x00000004
#define _CFD4FIFOSTA2_TXATIF_MASK                0x00000010
#define _CFD4FIFOSTA2_TXATIF_LENGTH              0x00000001

#define _CFD4FIFOSTA2_TXERR_POSITION             0x00000005
#define _CFD4FIFOSTA2_TXERR_MASK                 0x00000020
#define _CFD4FIFOSTA2_TXERR_LENGTH               0x00000001

#define _CFD4FIFOSTA2_TXLARB_POSITION            0x00000006
#define _CFD4FIFOSTA2_TXLARB_MASK                0x00000040
#define _CFD4FIFOSTA2_TXLARB_LENGTH              0x00000001

#define _CFD4FIFOSTA2_TXABT_POSITION             0x00000007
#define _CFD4FIFOSTA2_TXABT_MASK                 0x00000080
#define _CFD4FIFOSTA2_TXABT_LENGTH               0x00000001

#define _CFD4FIFOSTA2_FIFOCI_POSITION            0x00000008
#define _CFD4FIFOSTA2_FIFOCI_MASK                0x00001F00
#define _CFD4FIFOSTA2_FIFOCI_LENGTH              0x00000005

#define _CFD4FIFOUA2_FIFOUA_POSITION             0x00000000
#define _CFD4FIFOUA2_FIFOUA_MASK                 0xFFFFFFFF
#define _CFD4FIFOUA2_FIFOUA_LENGTH               0x00000020

#define _CFD4FIFOCON3_TFNRFNIE_POSITION          0x00000000
#define _CFD4FIFOCON3_TFNRFNIE_MASK              0x00000001
#define _CFD4FIFOCON3_TFNRFNIE_LENGTH            0x00000001

#define _CFD4FIFOCON3_TFHRFHIE_POSITION          0x00000001
#define _CFD4FIFOCON3_TFHRFHIE_MASK              0x00000002
#define _CFD4FIFOCON3_TFHRFHIE_LENGTH            0x00000001

#define _CFD4FIFOCON3_TFERFFIE_POSITION          0x00000002
#define _CFD4FIFOCON3_TFERFFIE_MASK              0x00000004
#define _CFD4FIFOCON3_TFERFFIE_LENGTH            0x00000001

#define _CFD4FIFOCON3_RXOVIE_POSITION            0x00000003
#define _CFD4FIFOCON3_RXOVIE_MASK                0x00000008
#define _CFD4FIFOCON3_RXOVIE_LENGTH              0x00000001

#define _CFD4FIFOCON3_TXATIE_POSITION            0x00000004
#define _CFD4FIFOCON3_TXATIE_MASK                0x00000010
#define _CFD4FIFOCON3_TXATIE_LENGTH              0x00000001

